{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFD"
      },
      {
        "type": "Lowercase"
      },
      {
        "type": "Strip",
        "strip_left": true,
        "strip_right": true
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          3
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "-",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "[EOS]": 5,
      "!": 6,
      "'": 7,
      ",": 8,
      "-": 9,
      ".": 10,
      "?": 11,
      "a": 12,
      "b": 13,
      "c": 14,
      "d": 15,
      "e": 16,
      "f": 17,
      "g": 18,
      "h": 19,
      "i": 20,
      "j": 21,
      "k": 22,
      "l": 23,
      "m": 24,
      "n": 25,
      "o": 26,
      "p": 27,
      "q": 28,
      "r": 29,
      "s": 30,
      "t": 31,
      "u": 32,
      "v": 33,
      "w": 34,
      "x": 35,
      "y": 36,
      "z": 37,
      "۔": 38,
      "-a": 39,
      "-n": 40,
      "-g": 41,
      "-i": 42,
      "-s": 43,
      "-l": 44,
      "-y": 45,
      "-h": 46,
      "-u": 47,
      "-m": 48,
      "-j": 49,
      "-e": 50,
      "-d": 51,
      "-r": 52,
      "-t": 53,
      "-o": 54,
      "-k": 55,
      "-z": 56,
      "-b": 57,
      "-f": 58,
      "-p": 59,
      "-v": 60,
      "-q": 61,
      "-c": 62,
      "-x": 63,
      "--": 64,
      "-'": 65,
      "-w": 66,
      "-ar": 67,
      "ha": 68,
      "-ha": 69,
      "-hi": 70,
      "hai": 71,
      "-an": 72,
      "na": 73,
      "ki": 74,
      "ka": 75,
      "-at": 76,
      "-en": 77,
      "-ya": 78,
      "-un": 79,
      "-ah": 80,
      "ja": 81,
      "se": 82,
      "men": 83,
      "ko": 84,
      "sa": 85,
      "-in": 86,
      "-sh": 87,
      "-il": 88,
      "-ir": 89,
      "ma": 90,
      "ba": 91,
      "ke": 92,
      "-am": 93,
      "ho": 94,
      "-kh": 95,
      "-hin": 96,
      "-ur": 97,
      "-da": 98,
      "hu": 99,
      "-hu": 100,
      "hain": 101,
      "-ta": 102,
      "-on": 103,
      "to": 104,
      "ra": 105,
      "bhi": 106,
      "-han": 107,
      "aa": 108,
      "kar": 109,
      "-ch": 110,
      "-al": 111,
      "ham": 112,
      "dil": 113,
      "nahin": 114,
      "-is": 115,
      "mu": 116,
      "-ab": 117,
      "-he": 118,
      "-har": 119,
      "tu": 120,
      "-te": 121,
      "kya": 122,
      "ga": 123,
      "sha": 124,
      "vo": 125,
      "ye": 126,
      "-as": 127,
      "-na": 128,
      "-ti": 129,
      "de": 130,
      "-ad": 131,
      "cha": 132,
      "us": 133,
      "-er": 134,
      "khu": 135,
      "jo": 136,
      "ta": 137,
      "-ul": 138,
      "kha": 139,
      "va": 140,
      "ab": 141,
      "ya": 142,
      "par": 143,
      "ne": 144,
      "hi": 145,
      "ku": 146,
      "tha": 147,
      "-la": 148,
      "-chh": 149,
      "-ne": 150,
      "main": 151,
      "gha": 152,
      "muj": 153,
      "-va": 154,
      "rah": 155,
      "-hir": 156,
      "la": 157,
      "ni": 158,
      "pa": 159,
      "be": 160,
      "di": 161,
      "-gar": 162,
      "-ana": 163,
      "ap": 164,
      "dar": 165,
      "-ye": 166,
      "huun": 167,
      "-zar": 168,
      "mir": 169,
      "koi": 170,
      "tir": 171,
      "kuchh": 172,
      "aur": 173,
      "-ho": 174,
      "kis": 175,
      "-uun": 176,
      "-ut": 177,
      "an": 178,
      "har": 179,
      "pe": 180,
      "-gi": 181,
      "-ga": 182,
      "mer": 183,
      "-man": 184,
      "-ara": 185,
      "si": 186,
      "is": 187,
      "gaya": 188,
      "da": 189,
      "ish": 190,
      "dekh": 191,
      "phir": 192,
      "-ane": 193,
      "li": 194,
      "ik": 195,
      "-ma": 196,
      "-ari": 197,
      "bah": 198,
      "tum": 199,
      "kab": 200,
      "-ge": 201,
      "sab": 202,
      "-li": 203,
      "as": 204,
      "-gh": 205,
      "ai": 206,
      "-le": 207,
      "hua": 208,
      "sar": 209,
      "du": 210,
      "ter": 211,
      "un": 212,
      "ch": 213,
      "-ni": 214,
      "jis": 215,
      "kah": 216,
      "ishq": 217,
      "gu": 218,
      "-ra": 219,
      "mujhe": 220,
      "-ang": 221,
      "tar": 222,
      "-za": 223,
      "-ata": 224,
      "-jh": 225,
      "thi": 226,
      "mil": 227,
      "gar": 228,
      "raha": 229,
      "gham": 230,
      "mujh": 231,
      "jaa": 232,
      "tak": 233,
      "le": 234,
      "su": 235,
      "-kha": 236,
      "kh": 237,
      "jab": 238,
      "ji": 239,
      "-di": 240,
      "ut": 241,
      "-hr": 242,
      "-fa": 243,
      "ky": 244,
      "-sha": 245,
      "-iya": 246,
      "ru": 247,
      "ek": 248,
      "-ani": 249,
      "en": 250,
      "-ate": 251,
      "gul": 252,
      "za": 253,
      "nazar": 254,
      "-ath": 255,
      "mo": 256,
      "bar": 257,
      "-yan": 258,
      "bad": 259,
      "-aq": 260,
      "do": 261,
      "nik": 262,
      "zin": 263,
      "ban": 264,
      "mire": 265,
      "-us": 266,
      "kabhi": 267,
      "mar": 268,
      "so": 269,
      "ghar": 270,
      "-mi": 271,
      "-bar": 272,
      "kahan": 273,
      "-ala": 274,
      "kyuun": 275,
      "rahe": 276,
      "in": 277,
      "the": 278,
      "kisi": 279,
      "-ise": 280,
      "-bat": 281,
      "jan": 282,
      "apne": 283,
      "bahut": 284,
      "aaj": 285,
      "zam": 286,
      "man": 287,
      "sam": 288,
      "tiri": 289,
      "tire": 290,
      "-it": 291,
      "kiya": 292,
      "-gah": 293,
      "magar": 294,
      "sak": 295,
      "apni": 296,
      "-var": 297,
      "hue": 298,
      "shab": 299,
      "zinda": 300,
      "al": 301,
      "mah": 302,
      "rang": 303,
      "sun": 304,
      "agar": 305,
      "-mat": 306,
      "-hiye": 307,
      "pu": 308,
      "pah": 309,
      "-are": 310,
      "tujh": 311,
      "jal": 312,
      "-uq": 313,
      "baat": 314,
      "din": 315,
      "nigah": 316,
      "dam": 317,
      "qa": 318,
      "-sa": 319,
      "hui": 320,
      "miri": 321,
      "meri": 322,
      "az": 323,
      "-hab": 324,
      "khud": 325,
      "ak": 326,
      "-ib": 327,
      "ankh": 328,
      "naz": 329,
      "liye": 330,
      "qad": 331,
      "has": 332,
      "sho": 333,
      "-ish": 334,
      "-um": 335,
      "-ati": 336,
      "shar": 337,
      "kam": 338,
      "khuda": 339,
      "tarah": 340,
      "ro": 341,
      "-ka": 342,
      "bas": 343,
      "diya": 344,
      "mere": 345,
      "shi": 346,
      "-rat": 347,
      "lo": 348,
      "hota": 349,
      "yaad": 350,
      "dard": 351,
      "sah": 352,
      "-kin": 353,
      "bhar": 354,
      "-st": 355,
      "-kar": 356,
      "-iz": 357,
      "-shi": 358,
      "-van": 359,
      "jahan": 360,
      "apna": 361,
      "bi": 362,
      "-cha": 363,
      "zindagi": 364,
      "ah": 365,
      "-az": 366,
      "-yat": 367,
      "tam": 368,
      "-dar": 369,
      "jaan": 370,
      "chal": 371,
      "ar": 372,
      "-de": 373,
      "hus": 374,
      "aap": 375,
      "sur": 376,
      "-uj": 377,
      "ash": 378,
      "dun": 379,
      "kahin": 380,
      "husn": 381,
      "yuun": 382,
      "jaane": 383,
      "gir": 384,
      "aaya": 385,
      "vahi": 386,
      "mohab": 387,
      "mohabbat": 388,
      "saath": 389,
      "khan": 390,
      "-tar": 391,
      "aan": 392,
      "duniya": 393,
      "char": 394,
      "um": 395,
      "-dan": 396,
      "sham": 397,
      "lag": 398,
      "chan": 399,
      "lab": 400,
      "vaq": 401,
      "zar": 402,
      "-ak": 403,
      "teri": 404,
      "it": 405,
      "-hen": 406,
      "tab": 407,
      "kaun": 408,
      "-hun": 409,
      "khush": 410,
      "abhi": 411,
      "zab": 412,
      "zul": 413,
      "-ban": 414,
      "mai": 415,
      "raat": 416,
      "shahr": 417,
      "khat": 418,
      "log": 419,
      "-im": 420,
      "-ale": 421,
      "vafa": 422,
      "tere": 423,
      "af": 424,
      "-lam": 425,
      "-ve": 426,
      "-jhe": 427,
      "-far": 428,
      "rahi": 429,
      "chand": 430,
      "bhu": 431,
      "qat": 432,
      "-vab": 433,
      "-hal": 434,
      "bada": 435,
      "rakh": 436,
      "ina": 437,
      "bat": 438,
      "tas": 439,
      "hamen": 440,
      "chash": 441,
      "mera": 442,
      "lekin": 443,
      "puchh": 444,
      "aj": 445,
      "ada": 446,
      "-sta": 447,
      "ais": 448,
      "-qat": 449,
      "dekha": 450,
      "hij": 451,
      "chho": 452,
      "sub": 453,
      "vaqt": 454,
      "haath": 455,
      "chu": 456,
      "-ast": 457,
      "tan": 458,
      "baz": 459,
      "ju": 460,
      "-agh": 461,
      "nas": 462,
      "kare": 463,
      "karte": 464,
      "chashm": 465,
      "khar": 466,
      "pad": 467,
      "-aya": 468,
      "-id": 469,
      "-yad": 470,
      "hon": 471,
      "pai": 472,
      "hava": 473,
      "guzar": 474,
      "-kan": 475,
      "use": 476,
      "ad": 477,
      "-uf": 478,
      "-re": 479,
      "-enge": 480,
      "jam": 481,
      "mira": 482,
      "-lib": 483,
      "fa": 484,
      "-ub": 485,
      "-anj": 486,
      "go": 487,
      "-chch": 488,
      "bahar": 489,
      "-aqi": 490,
      "ankhon": 491,
      "tal": 492,
      "tira": 493,
      "tara": 494,
      "-gha": 495,
      "hal": 496,
      "-ud": 497,
      "-fat": 498,
      "jaate": 499,
      "-ina": 500,
      "-che": 501,
      "tera": 502,
      "yar": 503,
      "naam": 504,
      "far": 505,
      "kho": 506,
      "mat": 507,
      "ul": 508,
      "-dhar": 509,
      "-kr": 510,
      "hoga": 511,
      "me": 512,
      "mun": 513,
      "kaam": 514,
      "vas": 515,
      "han": 516,
      "shauq": 517,
      "kahte": 518,
      "suk": 519,
      "dost": 520,
      "-fil": 521,
      "-sht": 522,
      "-khm": 523,
      "chahiye": 524,
      "ashi": 525,
      "zaban": 526,
      "at": 527,
      "achch": 528,
      "sahi": 529,
      "-ali": 530,
      "chale": 531,
      "sit": 532,
      "utha": 533,
      "aate": 534,
      "-ke": 535,
      "khabar": 536,
      "liya": 537,
      "zulf": 538,
      "jun": 539,
      "-yon": 540,
      "-yal": 541,
      "tujhe": 542,
      "bana": 543,
      "jin": 544,
      "khi": 545,
      "vah": 546,
      "-shan": 547,
      "-ri": 548,
      "mas": 549,
      "yaan": 550,
      "khvab": 551,
      "jaana": 552,
      "-vaz": 553,
      "zakhm": 554,
      "manz": 555,
      "aankh": 556,
      "junun": 557,
      "pya": 558,
      "-san": 559,
      "sama": 560,
      "mauj": 561,
      "khayal": 562,
      "umr": 563,
      "var": 564,
      "-ila": 565,
      "duur": 566,
      "chhu": 567,
      "san": 568,
      "-gan": 569,
      "-khi": 570,
      "jaata": 571,
      "shakh": 572,
      "laa": 573,
      "akhir": 574,
      "ahl": 575,
      "hijr": 576,
      "taraf": 577,
      "suun": 578,
      "te": 579,
      "-pa": 580,
      "sada": 581,
      "-ind": 582,
      "bait": 583,
      "ghair": 584,
      "dush": 585,
      "chhod": 586,
      "fir": 587,
      "kaise": 588,
      "hoti": 589,
      "-tab": 590,
      "khaak": 591,
      "laga": 592,
      "guz": 593,
      "jigar": 594,
      "-shat": 595,
      "band": 596,
      "bazm": 597,
      "aata": 598,
      "-ja": 599,
      "naq": 600,
      "yahi": 601,
      "manzil": 602,
      "pur": 603,
      "-ki": 604,
      "-zan": 605,
      "-qi": 606,
      "jaise": 607,
      "safar": 608,
      "baar": 609,
      "aad": 610,
      "mud": 611,
      "bha": 612,
      "fas": 613,
      "pi": 614,
      "-vat": 615,
      "kit": 616,
      "-shk": 617,
      "yahan": 618,
      "dagh": 619,
      "dekhte": 620,
      "surat": 621,
      "bu": 622,
      "dast": 623,
      "-yar": 624,
      "-hon": 625,
      "karo": 626,
      "kham": 627,
      "yak": 628,
      "dikha": 629,
      "dariya": 630,
      "nikle": 631,
      "bul": 632,
      "hote": 633,
      "-ura": 634,
      "ghalib": 635,
      "khun": 636,
      "zamin": 637,
      "ankhen": 638,
      "roz": 639,
      "am": 640,
      "phu": 641,
      "zara": 642,
      "-sat": 643,
      "-qa": 644,
      "chaman": 645,
      "khul": 646,
      "nikla": 647,
      "inti": 648,
      "ega": 649,
      "-ikr": 650,
      "firaq": 651,
      "che": 652,
      "nis": 653,
      "-tan": 654,
      "ghaz": 655,
      "-alak": 656,
      "zamana": 657,
      "qadam": 658,
      "samajh": 659,
      "-iyan": 660,
      "-tish": 661,
      "yaar": 662,
      "kuun": 663,
      "pahle": 664,
      "sitam": 665,
      "dhun": 666,
      "shayad": 667,
      "lagta": 668,
      "bo": 669,
      "chi": 670,
      "dhu": 671,
      "fur": 672,
      "ghu": 673,
      "il": 674,
      "-su": 675,
      "-zu": 676,
      "-had": 677,
      "-ahr": 678,
      "maq": 679,
      "tumhar": 680,
      "mile": 681,
      "alam": 682,
      "qaya": 683,
      "aisa": 684,
      "tanha": 685,
      "iin": 686,
      "-sar": 687,
      "kal": 688,
      "kais": 689,
      "ras": 690,
      "mus": 691,
      "nikal": 692,
      "dushman": 693,
      "-hta": 694,
      "kiye": 695,
      "siva": 696,
      "jalva": 697,
      "charagh": 698,
      "mehr": 699,
      "sukhan": 700,
      "aise": 701,
      "aati": 702,
      "-hat": 703,
      "kaf": 704,
      "asad": 705,
      "milta": 706,
      "rukh": 707,
      "hasti": 708,
      "shik": 709,
      "atish": 710,
      "but": 711,
      "den": 712,
      "-uk": 713,
      "-kht": 714,
      "aalam": 715,
      "karen": 716,
      "suna": 717,
      "ashna": 718,
      "badal": 719,
      "kharab": 720,
      "qayamat": 721,
      "re": 722,
      "haal": 723,
      "kaha": 724,
      "jaati": 725,
      "-daz": 726,
      "usi": 727,
      "anj": 728,
      "-mid": 729,
      "ashiq": 730,
      "aah": 731,
      "eh": 732,
      "khin": 733,
      "shu": 734,
      "she": 735,
      "-ba": 736,
      "-fas": 737,
      "divar": 738,
      "bhuul": 739,
      "baten": 740,
      "aadmi": 741,
      "qar": 742,
      "ti": 743,
      "-val": 744,
      "-vana": 745,
      "-ham": 746,
      "saa": 747,
      "raah": 748,
      "kahun": 749,
      "daman": 750,
      "sahra": 751,
      "hans": 752,
      "achchha": 753,
      "vahshat": 754,
      "-anv": 755,
      "sau": 756,
      "raf": 757,
      "shai": 758,
      "dua": 759,
      "jise": 760,
      "soch": 761,
      "mahfil": 762,
      "khana": 763,
      "munh": 764,
      "pyaar": 765,
      "varna": 766,
      "phuul": 767,
      "iz": 768,
      "qis": 769,
      "-aj": 770,
      "-ine": 771,
      "aage": 772,
      "shaam": 773,
      "asman": 774,
      "mila": 775,
      "sharab": 776,
      "gun": 777,
      "im": 778,
      "lut": 779,
      "-gu": 780,
      "-ji": 781,
      "hazar": 782,
      "hayat": 783,
      "nash": 784,
      "saaqi": 785,
      "maj": 786,
      "rab": 787,
      "hamari": 788,
      "zamane": 789,
      "sake": 790,
      "aisi": 791,
      "juda": 792,
      "dhund": 793,
      "ara": 794,
      "jhu": 795,
      "pas": 796,
      "-dat": 797,
      "hav": 798,
      "baaqi": 799,
      "rak": 800,
      "qadar": 801,
      "sahar": 802,
      "tamam": 803,
      "itna": 804,
      "qatil": 805,
      "faq": 806,
      "hun": 807,
      "mis": 808,
      "uda": 809,
      "-je": 810,
      "sad": 811,
      "mast": 812,
      "-hane": 813,
      "hamare": 814,
      "lage": 815,
      "tumhen": 816,
      "saba": 817,
      "samj": 818,
      "hasrat": 819,
      "ashk": 820,
      "talab": 821,
      "aar": 822,
      "lah": 823,
      "sang": 824,
      "hat": 825,
      "bal": 826,
      "bala": 827,
      "hosh": 828,
      "raq": 829,
      "vaale": 830,
      "ani": 831,
      "utar": 832,
      "enge": 833,
      "sakta": 834,
      "pahun": 835,
      "ulfat": 836,
      "av": 837,
      "fit": 838,
      "len": 839,
      "pal": 840,
      "qab": 841,
      "-lat": 842,
      "-uh": 843,
      "haa": 844,
      "-anna": 845,
      "kash": 846,
      "kahiye": 847,
      "vaala": 848,
      "abr": 849,
      "paa": 850,
      "paaya": 851,
      "andaz": 852,
      "likh": 853,
      "asar": 854,
      "kyun": 855,
      "tamanna": 856,
      "afs": 857,
      "naqsh": 858,
      "egi": 859,
      "gali": 860,
      "-hra": 861,
      "-uhar": 862,
      "-mar": 863,
      "-zi": 864,
      "-hid": 865,
      "paas": 866,
      "ajab": 867,
      "shakhs": 868,
      "guzre": 869,
      "bata": 870,
      "khir": 871,
      "mit": 872,
      "ranj": 873,
      "-ghan": 874,
      "-bul": 875,
      "haq": 876,
      "-asha": 877,
      "daur": 878,
      "lete": 879,
      "khva": 880,
      "badan": 881,
      "all": 882,
      "avaz": 883,
      "gah": 884,
      "iye": 885,
      "khe": 886,
      "pat": 887,
      "qas": 888,
      "ud": 889,
      "zo": 890,
      "-nam": 891,
      "-if": 892,
      "-hte": 893,
      "nau": 894,
      "kaho": 895,
      "-yam": 896,
      "-khe": 897,
      "-uri": 898,
      "-hana": 899,
      "karun": 900,
      "karta": 901,
      "khak": 902,
      "parda": 903,
      "isi": 904,
      "-hre": 905,
      "shor": 906,
      "baithe": 907,
      "havas": 908,
      "aane": 909,
      "bis": 910,
      "falak": 911,
      "his": 912,
      "mi": 913,
      "-zat": 914,
      "haan": 915,
      "-and": 916,
      "nam": 917,
      "mal": 918,
      "maza": 919,
      "-urda": 920,
      "mushk": 921,
      "paanv": 922,
      "-araz": 923,
      "guman": 924,
      "jit": 925,
      "zafar": 926,
      "sharm": 927,
      "tamasha": 928,
      "khatir": 929,
      "kaisi": 930,
      "vir": 931,
      "-uz": 932,
      "-jar": 933,
      "-ran": 934,
      "-osh": 935,
      "saz": 936,
      "saman": 937,
      "maut": 938,
      "maus": 939,
      "rag": 940,
      "dete": 941,
      "khal": 942,
      "khata": 943,
      "dekhna": 944,
      "-mak": 945,
      "ummid": 946,
      "tabi": 947,
      "paida": 948,
      "vasl": 949,
      "tegh": 950,
      "aarzu": 951,
      "kyunkar": 952,
      "mausam": 953,
      "ala": 954,
      "miz": 955,
      "tala": 956,
      "-ida": 957,
      "-ije": 958,
      "-vani": 959,
      "had": 960,
      "-hish": 961,
      "-ira": 962,
      "rau": 963,
      "rasta": 964,
      "-hani": 965,
      "karti": 966,
      "lagi": 967,
      "dukh": 968,
      "-dish": 969,
      "soz": 970,
      "alum": 971,
      "itni": 972,
      "ghazal": 973,
      "samjha": 974,
      "bane": 975,
      "fikr": 976,
      "ghun": 977,
      "gila": 978,
      "lam": 979,
      "mur": 980,
      "tah": 981,
      "-up": 982,
      "-eh": 983,
      "-ton": 984,
      "-ft": 985,
      "-ftar": 986,
      "-hista": 987,
      "nafas": 988,
      "jala": 989,
      "-shta": 990,
      "makan": 991,
      "bakh": 992,
      "karam": 993,
      "karna": 994,
      "hamara": 995,
      "khuun": 996,
      "khula": 997,
      "-ula": 998,
      "pare": 999,
      "gardish": 1000,
      "marg": 1001,
      "chalo": 1002,
      "pade": 1003,
      "muddat": 1004,
      "intizar": 1005,
      "khinch": 1006,
      "ahista": 1007,
      "buj": 1008,
      "don": 1009,
      "kan": 1010,
      "rish": 1011,
      "zanj": 1012,
      "-eban": 1013,
      "-bu": 1014,
      "-bad": 1015,
      "-vir": 1016,
      "-shar": 1017,
      "hona": 1018,
      "khudi": 1019,
      "khushi": 1020,
      "taq": 1021,
      "vahan": 1022,
      "yaq": 1023,
      "siya": 1024,
      "dekho": 1025,
      "sabr": 1026,
      "unhen": 1027,
      "kahna": 1028,
      "zahir": 1029,
      "zauq": 1030,
      "jante": 1031,
      "aansu": 1032,
      "chehre": 1033,
      "chiiz": 1034,
      "khvahish": 1035,
      "mushkil": 1036,
      "pareshan": 1037,
      "donon": 1038,
      "zanjir": 1039,
      "idhar": 1040,
      "qal": 1041,
      "rat": 1042,
      "zal": 1043,
      "-ash": 1044,
      "-nat": 1045,
      "-rar": 1046,
      "-bi": 1047,
      "haz": 1048,
      "saf": 1049,
      "raus": 1050,
      "aag": 1051,
      "aave": 1052,
      "-istan": 1053,
      "muq": 1054,
      "chala": 1055,
      "laz": 1056,
      "and": 1057,
      "dava": 1058,
      "dasht": 1059,
      "jism": 1060,
      "gareban": 1061,
      "moh": 1062,
      "janan": 1063,
      "samb": 1064,
      "khushbu": 1065,
      "qatra": 1066,
      "fasl": 1067,
      "ghubar": 1068,
      "qismat": 1069,
      "lutf": 1070,
      "-jiye": 1071,
      "hathon": 1072,
      "raushan": 1073,
      "udhar": 1074,
      "val": 1075,
      "zikr": 1076,
      "-si": 1077,
      "-se": 1078,
      "-uma": 1079,
      "-oge": 1080,
      "naaz": 1081,
      "jaz": 1082,
      "koh": 1083,
      "sach": 1084,
      "-she": 1085,
      "-shr": 1086,
      "hone": 1087,
      "musa": 1088,
      "-hed": 1089,
      "beg": 1090,
      "kahta": 1091,
      "tark": 1092,
      "jaao": 1093,
      "rus": 1094,
      "azad": 1095,
      "hasil": 1096,
      "shokh": 1097,
      "-shish": 1098,
      "-lamat": 1099,
      "honge": 1100,
      "faza": 1101,
      "laakh": 1102,
      "bulbul": 1103,
      "sher": 1104,
      "allah": 1105,
      "bin": 1106,
      "fari": 1107,
      "fare": 1108,
      "ir": 1109,
      "ila": 1110,
      "lu": 1111,
      "qur": 1112,
      "tho": 1113,
      "vali": 1114,
      "nagh": 1115,
      "kat": 1116,
      "saj": 1117,
      "bagha": 1118,
      "-khar": 1119,
      "raz": 1120,
      "josh": 1121,
      "niya": 1122,
      "paani": 1123,
      "haram": 1124,
      "uth": 1125,
      "sakti": 1126,
      "ahd": 1127,
      "nasib": 1128,
      "fursat": 1129,
      "tumhare": 1130,
      "lazzat": 1131,
      "sir": 1132,
      "tari": 1133,
      "uj": 1134,
      "vis": 1135,
      "-hur": 1136,
      "-khiye": 1137,
      "-chan": 1138,
      "kiije": 1139,
      "-undar": 1140,
      "jag": 1141,
      "saari": 1142,
      "saare": 1143,
      "baha": 1144,
      "-khti": 1145,
      "niind": 1146,
      "didar": 1147,
      "zindan": 1148,
      "insan": 1149,
      "samjhe": 1150,
      "samundar": 1151,
      "rakhte": 1152,
      "tasvir": 1153,
      "khol": 1154,
      "mudda": 1155,
      "hunar": 1156,
      "lahu": 1157,
      "rusva": 1158,
      "visal": 1159,
      "aana": 1160,
      "pata": 1161,
      "zer": 1162,
      "-sin": 1163,
      "-fi": 1164,
      "-vv": 1165,
      "haqi": 1166,
      "hashr": 1167,
      "nava": 1168,
      "jafa": 1169,
      "saan": 1170,
      "saza": 1171,
      "-dad": 1172,
      "rashk": 1173,
      "hamin": 1174,
      "dekhiye": 1175,
      "chaar": 1176,
      "tap": 1177,
      "vaj": 1178,
      "rahta": 1179,
      "pada": 1180,
      "harf": 1181,
      "gard": 1182,
      "khur": 1183,
      "puch": 1184,
      "shokhi": 1185,
      "gira": 1186,
      "chara": 1187,
      "aji": 1188,
      "hijab": 1189,
      "chup": 1190,
      "juz": 1191,
      "adam": 1192,
      "chhup": 1193,
      "kitna": 1194,
      "furqat": 1195,
      "raste": 1196,
      "ehsan": 1197,
      "rafta": 1198,
      "qasam": 1199,
      "zalim": 1200,
      "baghair": 1201,
      "haqiqat": 1202,
      "faraz": 1203,
      "jur": 1204,
      "-ghar": 1205,
      "-mil": 1206,
      "-dam": 1207,
      "-ron": 1208,
      "-vish": 1209,
      "-hala": 1210,
      "jauhar": 1211,
      "say": 1212,
      "maz": 1213,
      "tod": 1214,
      "chahe": 1215,
      "tava": 1216,
      "divana": 1217,
      "sabhi": 1218,
      "gum": 1219,
      "garm": 1220,
      "ruuh": 1221,
      "gulshan": 1222,
      "shabnam": 1223,
      "bich": 1224,
      "arz": 1225,
      "logon": 1226,
      "-ghaf": 1227,
      "halat": 1228,
      "achchhi": 1229,
      "chhupa": 1230,
      "bhala": 1231,
      "kitne": 1232,
      "yaaro": 1233,
      "dhuup": 1234,
      "faqat": 1235,
      "hisab": 1236,
      "sambhal": 1237,
      "ajiib": 1238,
      "bura": 1239,
      "dha": 1240,
      "dan": 1241,
      "dho": 1242,
      "ghur": 1243,
      "ij": 1244,
      "pin": 1245,
      "ron": 1246,
      "shir": 1247,
      "sara": 1248,
      "-uman": 1249,
      "-me": 1250,
      "-tin": 1251,
      "-thar": 1252,
      "hairat": 1253,
      "nama": 1254,
      "-atan": 1255,
      "javab": 1256,
      "saghar": 1257,
      "maan": 1258,
      "mash": 1259,
      "bayan": 1260,
      "aab": 1261,
      "-all": 1262,
      "shah": 1263,
      "der": 1264,
      "deta": 1265,
      "taghaf": 1266,
      "abad": 1267,
      "pari": 1268,
      "diye": 1269,
      "divan": 1270,
      "dari": 1271,
      "siine": 1272,
      "dekhe": 1273,
      "thiin": 1274,
      "gharib": 1275,
      "janta": 1276,
      "samne": 1277,
      "azma": 1278,
      "ake": 1279,
      "sharar": 1280,
      "suraj": 1281,
      "qatl": 1282,
      "tez": 1283,
      "chehra": 1284,
      "nishan": 1285,
      "dhuan": 1286,
      "maqam": 1287,
      "kafir": 1288,
      "qarar": 1289,
      "shaikh": 1290,
      "gunah": 1291,
      "begana": 1292,
      "fareb": 1293,
      "taghaful": 1294,
      "avar": 1295,
      "-nun": 1296,
      "-iha": 1297,
      "-bab": 1298,
      "naya": 1299,
      "maana": 1300,
      "bazar": 1301,
      "-isa": 1302,
      "tuk": 1303,
      "chahta": 1304,
      "khuub": 1305,
      "taqat": 1306,
      "vaan": 1307,
      "nihan": 1308,
      "dida": 1309,
      "daagh": 1310,
      "asan": 1311,
      "kahen": 1312,
      "barq": 1313,
      "gharaz": 1314,
      "-miyan": 1315,
      "-kayat": 1316,
      "khane": 1317,
      "itne": 1318,
      "zabt": 1319,
      "jamal": 1320,
      "faiz": 1321,
      "shikast": 1322,
      "imti": 1323,
      "khiram": 1324,
      "ghuncha": 1325,
      "yaqin": 1326,
      "hazrat": 1327,
      "naghma": 1328,
      "sayyad": 1329,
      "aq": 1330,
      "dahr": 1331,
      "ikhti": 1332,
      "jang": 1333,
      "lala": 1334,
      "pir": 1335,
      "shan": 1336,
      "tish": 1337,
      "ub": 1338,
      "-avv": 1339,
      "-lon": 1340,
      "-zr": 1341,
      "-bani": 1342,
      "-fir": 1343,
      "kahe": 1344,
      "-shni": 1345,
      "bach": 1346,
      "bacha": 1347,
      "-khta": 1348,
      "-ure": 1349,
      "-tak": 1350,
      "karne": 1351,
      "dilon": 1352,
      "mub": 1353,
      "tuu": 1354,
      "khali": 1355,
      "vaa": 1356,
      "thahar": 1357,
      "rahgu": 1358,
      "nib": 1359,
      "-gahi": 1360,
      "sabab": 1361,
      "dub": 1362,
      "chha": 1363,
      "tarz": 1364,
      "utt": 1365,
      "ruk": 1366,
      "barbad": 1367,
      "mard": 1368,
      "saka": 1369,
      "azi": 1370,
      "akbar": 1371,
      "hasin": 1372,
      "-shid": 1373,
      "khanjar": 1374,
      "zarra": 1375,
      "tasavv": 1376,
      "chuka": 1377,
      "sanam": 1378,
      "dastan": 1379,
      "rasm": 1380,
      "talash": 1381,
      "raushni": 1382,
      "andhe": 1383,
      "mohsin": 1384,
      "valon": 1385,
      "tishna": 1386,
      "rahguzar": 1387,
      "das": 1388,
      "hur": 1389,
      "iman": 1390,
      "miyan": 1391,
      "pan": 1392,
      "rut": 1393,
      "vatan": 1394,
      "zan": 1395,
      "-yo": 1396,
      "-ughan": 1397,
      "-vah": 1398,
      "hairan": 1399,
      "nala": 1400,
      "kin": 1401,
      "kahi": 1402,
      "kaash": 1403,
      "-yaban": 1404,
      "jalib": 1405,
      "sakht": 1406,
      "baja": 1407,
      "bayaban": 1408,
      "raaz": 1409,
      "mut": 1410,
      "tuut": 1411,
      "chamak": 1412,
      "taj": 1413,
      "parvana": 1414,
      "rahte": 1415,
      "paira": 1416,
      "kise": 1417,
      "pesh": 1418,
      "-arib": 1419,
      "rahat": 1420,
      "takall": 1421,
      "aksar": 1422,
      "basar": 1423,
      "basti": 1424,
      "bhari": 1425,
      "bhula": 1426,
      "rakhta": 1427,
      "puchho": 1428,
      "nashin": 1429,
      "goya": 1430,
      "intiha": 1431,
      "ghazab": 1432,
      "ilti": 1433,
      "kaisa": 1434,
      "musk": 1435,
      "shikva": 1436,
      "raqib": 1437,
      "siyah": 1438,
      "niyaz": 1439,
      "ikhtiyar": 1440,
      "tasavvur": 1441,
      "gan": 1442,
      "ib": 1443,
      "nar": 1444,
      "qarib": 1445,
      "yun": 1446,
      "yad": 1447,
      "zid": 1448,
      "-gam": 1449,
      "-son": 1450,
      "-lu": 1451,
      "-yyat": 1452,
      "-hgan": 1453,
      "-ram": 1454,
      "-fta": 1455,
      "-chi": 1456,
      "haus": 1457,
      "nakh": 1458,
      "nadan": 1459,
      "kade": 1460,
      "saaya": 1461,
      "salamat": 1462,
      "mad": 1463,
      "badi": 1464,
      "hogi": 1465,
      "-ulat": 1466,
      "khair": 1467,
      "khafa": 1468,
      "kusha": 1469,
      "ghafil": 1470,
      "-vafa": 1471,
      "raho": 1472,
      "payam": 1473,
      "betab": 1474,
      "bevafa": 1475,
      "hargi": 1476,
      "bahr": 1477,
      "chhed": 1478,
      "garche": 1479,
      "-diyon": 1480,
      "badh": 1481,
      "nazuk": 1482,
      "qadr": 1483,
      "shisha": 1484,
      "shikayat": 1485,
      "arzu": 1486,
      "girya": 1487,
      "zulm": 1488,
      "bhul": 1489,
      "paiman": 1490,
      "matl": 1491,
      "meh": 1492,
      "vasim": 1493,
      "hangam": 1494,
      "masti": 1495,
      "guzri": 1496,
      "bujh": 1497,
      "khamosh": 1498,
      "anjam": 1499,
      "tibar": 1500,
      "nashsha": 1501,
      "majnun": 1502,
      "dhundte": 1503,
      "rakkha": 1504,
      "misl": 1505,
      "avara": 1506,
      "qaba": 1507,
      "iyega": 1508,
      "patthar": 1509,
      "miza": 1510,
      "khalvat": 1511,
      "mizhgan": 1512,
      "musafir": 1513,
      "bichhad": 1514,
      "avargi": 1515,
      "aql": 1516,
      "pairahan": 1517,
      "yunhi": 1518,
      "hargiz": 1519,
      "dab": 1520,
      "dhar": 1521,
      "duun": 1522,
      "fughan": 1523,
      "iq": 1524,
      "lad": 1525,
      "numa": 1526,
      "sula": 1527,
      "ur": 1528,
      "-ite": 1529,
      "-uda": 1530,
      "-dari": 1531,
      "-kam": 1532,
      "haya": 1533,
      "nashat": 1534,
      "kitab": 1535,
      "jagah": 1536,
      "sahab": 1537,
      "saval": 1538,
      "raa": 1539,
      "karvan": 1540,
      "-asi": 1541,
      "-ass": 1542,
      "chak": 1543,
      "khauf": 1544,
      "paate": 1545,
      "dima": 1546,
      "ang": 1547,
      "kahne": 1548,
      "guft": 1549,
      "milne": 1550,
      "zahid": 1551,
      "banda": 1552,
      "mange": 1553,
      "manind": 1554,
      "pahchan": 1555,
      "qafas": 1556,
      "bikhar": 1557,
      "baton": 1558,
      "adab": 1559,
      "chuke": 1560,
      "naseh": 1561,
      "fais": 1562,
      "-ghaz": 1563,
      "rukhsat": 1564,
      "anjuman": 1565,
      "udaas": 1566,
      "khel": 1567,
      "bujha": 1568,
      "saans": 1569,
      "khurshid": 1570,
      "pinhan": 1571,
      "jangal": 1572,
      "takalluf": 1573,
      "matlab": 1574,
      "mizaj": 1575,
      "aam": 1576,
      "bhe": 1577,
      "jani": 1578,
      "talak": 1579,
      "zahr": 1580,
      "-zir": 1581,
      "-fan": 1582,
      "-vi": 1583,
      "-vari": 1584,
      "jaam": 1585,
      "javan": 1586,
      "javani": 1587,
      "sail": 1588,
      "baaz": 1589,
      "-dap": 1590,
      "-tal": 1591,
      "rasa": 1592,
      "mul": 1593,
      "shahid": 1594,
      "dega": 1595,
      "chali": 1596,
      "tadap": 1597,
      "him": 1598,
      "laf": 1599,
      "nigar": 1600,
      "darmiyan": 1601,
      "ped": 1602,
      "sikha": 1603,
      "dekhta": 1604,
      "phirte": 1605,
      "tumhin": 1606,
      "-lif": 1607,
      "aish": 1608,
      "duub": 1609,
      "guhar": 1610,
      "garmi": 1611,
      "khvar": 1612,
      "jiine": 1613,
      "-ust": 1614,
      "marne": 1615,
      "kahani": 1616,
      "pahlu": 1617,
      "nigahon": 1618,
      "-kash": 1619,
      "big": 1620,
      "bimar": 1621,
      "zarur": 1622,
      "puchhte": 1623,
      "-ufta": 1624,
      "farma": 1625,
      "vaste": 1626,
      "sukut": 1627,
      "sahil": 1628,
      "banaya": 1629,
      "jinhen": 1630,
      "vahm": 1631,
      "masiha": 1632,
      "kitni": 1633,
      "musal": 1634,
      "shukr": 1635,
      "tiir": 1636,
      "rakkhe": 1637,
      "pahunche": 1638,
      "fitrat": 1639,
      "rishta": 1640,
      "muqad": 1641,
      "jurm": 1642,
      "shirin": 1643,
      "akela": 1644,
      "faisla": 1645,
      "'-": 1646,
      "ay": 1647,
      "ana": 1648,
      "chin": 1649,
      "dur": 1650,
      "dal": 1651,
      "dad": 1652,
      "fana": 1653,
      "ge": 1654,
      "hir": 1655,
      "hina": 1656,
      "mina": 1657,
      "pha": 1658,
      "sat": 1659,
      "tur": 1660,
      "ziya": 1661,
      "-ugu": 1662,
      "-dir": 1663,
      "-ru": 1664,
      "-tir": 1665,
      "-oshi": 1666,
      "-zur": 1667,
      "-bra": 1668,
      "naf": 1669,
      "navaz": 1670,
      "-ahe": 1671,
      "koshish": 1672,
      "saya": 1673,
      "-inda": 1674,
      "bagh": 1675,
      "-alli": 1676,
      "dilbar": 1677,
      "mula": 1678,
      "-asta": 1679,
      "chad": 1680,
      "khuban": 1681,
      "khas": 1682,
      "parvaz": 1683,
      "thahr": 1684,
      "ghadi": 1685,
      "mujhi": 1686,
      "rahen": 1687,
      "laaya": 1688,
      "darkar": 1689,
      "pech": 1690,
      "dekhun": 1691,
      "dekhne": 1692,
      "likha": 1693,
      "sabza": 1694,
      "-lim": 1695,
      "tarab": 1696,
      "gulistan": 1697,
      "barpa": 1698,
      "badla": 1699,
      "sakte": 1700,
      "qaa": 1701,
      "qais": 1702,
      "nazr": 1703,
      "shikar": 1704,
      "lagti": 1705,
      "aftab": 1706,
      "taskin": 1707,
      "khila": 1708,
      "sanvar": 1709,
      "samajhte": 1710,
      "tumhari": 1711,
      "nikalti": 1712,
      "dena": 1713,
      "sauda": 1714,
      "pahuncha": 1715,
      "abru": 1716,
      "-urdagi": 1717,
      "jitna": 1718,
      "jitne": 1719,
      "raten": 1720,
      "jazb": 1721,
      "rone": 1722,
      "sarapa": 1723,
      "imtihan": 1724,
      "aziiz": 1725,
      "dimagh": 1726,
      "guftugu": 1727,
      "himmat": 1728,
      "lafz": 1729,
      "aza": 1730,
      "bari": 1731,
      "fan": 1732,
      "juun": 1733,
      "jum": 1734,
      "min": 1735,
      "py": 1736,
      "rind": 1737,
      "sata": 1738,
      "umid": 1739,
      "ze": 1740,
      "-gal": 1741,
      "-iq": 1742,
      "-jum": 1743,
      "-zam": 1744,
      "-bur": 1745,
      "naala": 1746,
      "naale": 1747,
      "kidhar": 1748,
      "kiran": 1749,
      "kalam": 1750,
      "kaif": 1751,
      "jaur": 1752,
      "sair": 1753,
      "safa": 1754,
      "baagh": 1755,
      "hujum": 1756,
      "aao": 1757,
      "hamdam": 1758,
      "dila": 1759,
      "gauhar": 1760,
      "deti": 1761,
      "vahin": 1762,
      "paras": 1763,
      "kucha": 1764,
      "nim": 1765,
      "pak": 1766,
      "bedad": 1767,
      "ande": 1768,
      "dahan": 1769,
      "daulat": 1770,
      "thik": 1771,
      "mili": 1772,
      "gardan": 1773,
      "barg": 1774,
      "baras": 1775,
      "badha": 1776,
      "samt": 1777,
      "mahshar": 1778,
      "rangin": 1779,
      "jalve": 1780,
      "azal": 1781,
      "nazm": 1782,
      "sahl": 1783,
      "aram": 1784,
      "arman": 1785,
      "giran": 1786,
      "charkh": 1787,
      "honton": 1788,
      "ashiqi": 1789,
      "khizan": 1790,
      "baitha": 1791,
      "bol": 1792,
      "maqtal": 1793,
      "tumhara": 1794,
      "butan": 1795,
      "dene": 1796,
      "qissa": 1797,
      "faqir": 1798,
      "hunuz": 1799,
      "misal": 1800,
      "fitna": 1801,
      "lena": 1802,
      "bismil": 1803,
      "malum": 1804,
      "viran": 1805,
      "mizha": 1806,
      "qalam": 1807,
      "sirf": 1808,
      "ganva": 1809,
      "hausla": 1810,
      "ziyada": 1811,
      "mulaqat": 1812,
      "thahri": 1813,
      "ag": 1814,
      "ava": 1815,
      "cho": 1816,
      "dhan": 1817,
      "dhal": 1818,
      "gari": 1819,
      "gale": 1820,
      "gure": 1821,
      "iyan": 1822,
      "just": 1823,
      "kun": 1824,
      "kul": 1825,
      "mata": 1826,
      "qam": 1827,
      "riz": 1828,
      "sina": 1829,
      "tad": 1830,
      "tang": 1831,
      "umi": 1832,
      "zeh": 1833,
      "-aza": 1834,
      "-esha": 1835,
      "-kta": 1836,
      "-kon": 1837,
      "-ze": 1838,
      "-flat": 1839,
      "-pe": 1840,
      "nakam": 1841,
      "kijiye": 1842,
      "kada": 1843,
      "kami": 1844,
      "kashi": 1845,
      "sali": 1846,
      "saqi": 1847,
      "-ile": 1848,
      "maara": 1849,
      "hove": 1850,
      "raun": 1851,
      "ravan": 1852,
      "ravish": 1853,
      "hamesha": 1854,
      "-isi": 1855,
      "-ist": 1856,
      "musht": 1857,
      "-abi": 1858,
      "dekhi": 1859,
      "chain": 1860,
      "chaak": 1861,
      "taz": 1862,
      "taar": 1863,
      "parva": 1864,
      "kuche": 1865,
      "ghabra": 1866,
      "ghaflat": 1867,
      "rahne": 1868,
      "lau": 1869,
      "dikh": 1870,
      "-gari": 1871,
      "angan": 1872,
      "-arak": 1873,
      "sifat": 1874,
      "daam": 1875,
      "phiri": 1876,
      "aib": 1877,
      "chhin": 1878,
      "milti": 1879,
      "uthe": 1880,
      "uthta": 1881,
      "-faq": 1882,
      "-shad": 1883,
      "sune": 1884,
      "dinon": 1885,
      "qaza": 1886,
      "qaid": 1887,
      "qafil": 1888,
      "kamal": 1889,
      "-uju": 1890,
      "ashufta": 1891,
      "khanda": 1892,
      "labon": 1893,
      "tabass": 1894,
      "khatm": 1895,
      "-ved": 1896,
      "chandni": 1897,
      "tasir": 1898,
      "chhoda": 1899,
      "havaon": 1900,
      "gosh": 1901,
      "ulti": 1902,
      "munta": 1903,
      "khil": 1904,
      "khizr": 1905,
      "sann": 1906,
      "fasana": 1907,
      "-suon": 1908,
      "maqs": 1909,
      "dushmani": 1910,
      "ehti": 1911,
      "qarari": 1912,
      "hazaron": 1913,
      "mitti": 1914,
      "zor": 1915,
      "bistar": 1916,
      "ilaaj": 1917,
      "puchhe": 1918,
      "ghurur": 1919,
      "muskura": 1920,
      "justuju": 1921,
      "zehn": 1922,
      "tabassum": 1923,
      "denge": 1924,
      "fis": 1925,
      "jha": 1926,
      "luun": 1927,
      "qub": 1928,
      "til": 1929,
      "yus": 1930,
      "zun": 1931,
      "zad": 1932,
      "-ada": 1933,
      "-ik": 1934,
      "-ibat": 1935,
      "-iyat": 1936,
      "-hbat": 1937,
      "-os": 1938,
      "-oh": 1939,
      "-bal": 1940,
      "-bish": 1941,
      "-vara": 1942,
      "-vane": 1943,
      "-qe": 1944,
      "hali": 1945,
      "-hak": 1946,
      "kas": 1947,
      "sal": 1948,
      "sap": 1949,
      "sadiyon": 1950,
      "-iri": 1951,
      "-khon": 1952,
      "huzur": 1953,
      "toh": 1954,
      "-alo": 1955,
      "-ism": 1956,
      "mum": 1957,
      "tufan": 1958,
      "shag": 1959,
      "khule": 1960,
      "khubi": 1961,
      "taur": 1962,
      "taab": 1963,
      "vada": 1964,
      "parde": 1965,
      "-lak": 1966,
      "ghata": 1967,
      "rahn": 1968,
      "rahna": 1969,
      "rahzan": 1970,
      "did": 1971,
      "auron": 1972,
      "harif": 1973,
      "daf": 1974,
      "dair": 1975,
      "daftar": 1976,
      "lik": 1977,
      "lib": 1978,
      "kabhu": 1979,
      "chhan": 1980,
      "milte": 1981,
      "taklif": 1982,
      "utna": 1983,
      "zada": 1984,
      "nazara": 1985,
      "sohbat": 1986,
      "janen": 1987,
      "manzar": 1988,
      "shabab": 1989,
      "mahv": 1990,
      "mahram": 1991,
      "suno": 1992,
      "sunte": 1993,
      "jalte": 1994,
      "nigahen": 1995,
      "aziz": 1996,
      "kamar": 1997,
      "shikan": 1998,
      "surma": 1999,
      "girah": 2000,
      "shams": 2001,
      "tabah": 2002,
      "bazi": 2003,
      "halqa": 2004,
      "faro": 2005,
      "sukun": 2006,
      "dushvar": 2007,
      "guzra": 2008,
      "buu": 2009,
      "khamoshi": 2010,
      "buland": 2011,
      "khulta": 2012,
      "bosa": 2013,
      "musibat": 2014,
      "badalte": 2015,
      "ret": 2016,
      "sheva": 2017,
      "saaf": 2018,
      "nashe": 2019,
      "pasand": 2020,
      "avval": 2021,
      "palat": 2022,
      "kashti": 2023,
      "afsana": 2024,
      "sharminda": 2025,
      "murad": 2026,
      "murgh": 2027,
      "pareshani": 2028,
      "raton": 2029,
      "muqab": 2030,
      "fariyad": 2031,
      "luut": 2032,
      "sajan": 2033,
      "vajud": 2034,
      "giraftar": 2035,
      "-halak": 2036,
      "mubarak": 2037,
      "ayyam": 2038,
      "jumbish": 2039,
      "minnat": 2040,
      "umiid": 2041,
      "qubul": 2042,
      "yusuf": 2043,
      "zunn": 2044,
      "akh": 2045,
      "azar": 2046,
      "agahi": 2047,
      "bina": 2048,
      "dana": 2049,
      "gin": 2050,
      "ine": 2051,
      "jhan": 2052,
      "nu": 2053,
      "nang": 2054,
      "nuq": 2055,
      "uq": 2056,
      "ula": 2057,
      "vus": 2058,
      "zi": 2059,
      "-non": 2060,
      "-gun": 2061,
      "-gis": 2062,
      "-ghal": 2063,
      "-sti": 2064,
      "-jli": 2065,
      "-zib": 2066,
      "-andi": 2067,
      "naha": 2068,
      "kaan": 2069,
      "jaad": 2070,
      "jaga": 2071,
      "jale": 2072,
      "jaisa": 2073,
      "sav": 2074,
      "saara": 2075,
      "may": 2076,
      "mazar": 2077,
      "magh": 2078,
      "malamat": 2079,
      "bahal": 2080,
      "baqa": 2081,
      "huk": 2082,
      "rahin": 2083,
      "rava": 2084,
      "aahat": 2085,
      "muam": 2086,
      "musta": 2087,
      "mushta": 2088,
      "gada": 2089,
      "shad": 2090,
      "shak": 2091,
      "cham": 2092,
      "chaun": 2093,
      "khum": 2094,
      "khub": 2095,
      "tai": 2096,
      "taqa": 2097,
      "-ulan": 2098,
      "vagar": 2099,
      "vaalo": 2100,
      "thak": 2101,
      "-lahat": 2102,
      "rahmat": 2103,
      "laut": 2104,
      "lakht": 2105,
      "lakhon": 2106,
      "nigahi": 2107,
      "beh": 2108,
      "bedar": 2109,
      "diin": 2110,
      "diid": 2111,
      "-uth": 2112,
      "andar": 2113,
      "sip": 2114,
      "sitar": 2115,
      "daad": 2116,
      "daana": 2117,
      "ishara": 2118,
      "ishare": 2119,
      "phirta": 2120,
      "sarab": 2121,
      "dus": 2122,
      "ungi": 2123,
      "jaag": 2124,
      "leta": 2125,
      "khvan": 2126,
      "jabin": 2127,
      "bade": 2128,
      "badle": 2129,
      "-ushi": 2130,
      "jannat": 2131,
      "agarche": 2132,
      "aks": 2133,
      "shola": 2134,
      "rote": 2135,
      "sahba": 2136,
      "bijli": 2137,
      "khushk": 2138,
      "bhule": 2139,
      "nasir": 2140,
      "padi": 2141,
      "padh": 2142,
      "paikar": 2143,
      "farhad": 2144,
      "ashiyan": 2145,
      "masj": 2146,
      "maslahat": 2147,
      "maujud": 2148,
      "khamushi": 2149,
      "amal": 2150,
      "nisar": 2151,
      "nisbat": 2152,
      "mehrbani": 2153,
      "reza": 2154,
      "iztir": 2155,
      "rabt": 2156,
      "raqam": 2157,
      "likhun": 2158,
      "afsos": 2159,
      "lamha": 2160,
      "tahzib": 2161,
      "ilahi": 2162,
      "thodi": 2163,
      "ujala": 2164,
      "charaghan": 2165,
      "dhoka": 2166,
      "ghurbat": 2167,
      "nargis": 2168,
      "hangama": 2169,
      "musalman": 2170,
      "muqaddar": 2171,
      "nafrat": 2172,
      "azaab": 2173,
      "gurezan": 2174,
      "raunaq": 2175,
      "dikhla": 2176,
      "muntazir": 2177,
      "mumkin": 2178,
      "shamshir": 2179,
      "muqabil": 2180,
      "zunnar": 2181,
      "ulajh": 2182,
      "jaadu": 2183,
      "mushtaq": 2184,
      "taqaza": 2185,
      "vagarna": 2186,
      "iztirab": 2187,
      "agh": 2188,
      "aghaz": 2189,
      "bhed": 2190,
      "egan": 2191,
      "fara": 2192,
      "fus": 2193,
      "jy": 2194,
      "jhon": 2195,
      "nur": 2196,
      "num": 2197,
      "pil": 2198,
      "piya": 2199,
      "ram": 2200,
      "sil": 2201,
      "sul": 2202,
      "sari": 2203,
      "uch": 2204,
      "ziyan": 2205,
      "zist": 2206,
      "-no": 2207,
      "-gani": 2208,
      "-sal": 2209,
      "-sari": 2210,
      "-yana": 2211,
      "-yyar": 2212,
      "-mon": 2213,
      "-jj": 2214,
      "-jat": 2215,
      "-rib": 2216,
      "-tu": 2217,
      "-kno": 2218,
      "-bari": 2219,
      "-fl": 2220,
      "-fr": 2221,
      "-vvat": 2222,
      "-ckno": 2223,
      "nab": 2224,
      "nagar": 2225,
      "kaa": 2226,
      "saq": 2227,
      "said": 2228,
      "bam": 2229,
      "baad": 2230,
      "bachch": 2231,
      "bashar": 2232,
      "raza": 2233,
      "karish": 2234,
      "karenge": 2235,
      "mukh": 2236,
      "tut": 2237,
      "gavara": 2238,
      "-adi": 2239,
      "chaha": 2240,
      "khuli": 2241,
      "khusha": 2242,
      "khumar": 2243,
      "khasta": 2244,
      "para": 2245,
      "parsa": 2246,
      "kushta": 2247,
      "kufr": 2248,
      "paar": 2249,
      "paim": 2250,
      "digar": 2251,
      "dijiye": 2252,
      "ansuon": 2253,
      "sim": 2254,
      "sid": 2255,
      "siin": 2256,
      "ise": 2257,
      "isti": 2258,
      "daa": 2259,
      "daal": 2260,
      "phire": 2261,
      "lip": 2262,
      "dukan": 2263,
      "unvan": 2264,
      "chura": 2265,
      "guftar": 2266,
      "taron": 2267,
      "-zakh": 2268,
      "sum": 2269,
      "khvah": 2270,
      "jivan": 2271,
      "jiina": 2272,
      "uthte": 2273,
      "ruuth": 2274,
      "enat": 2275,
      "gulab": 2276,
      "moti": 2277,
      "barab": 2278,
      "marte": 2279,
      "marham": 2280,
      "janab": 2281,
      "mans": 2282,
      "saki": 2283,
      "mahtab": 2284,
      "pahc": 2285,
      "-haba": 2286,
      "-ishen": 2287,
      "shart": 2288,
      "bhare": 2289,
      "bii": 2290,
      "-chal": 2291,
      "ahval": 2292,
      "chalta": 2293,
      "mohabbaton": 2294,
      "zaruri": 2295,
      "zulmat": 2296,
      "inayat": 2297,
      "chuki": 2298,
      "khari": 2299,
      "paigha": 2300,
      "guzarne": 2301,
      "yaron": 2302,
      "matam": 2303,
      "ulj": 2304,
      "sahib": 2305,
      "sitara": 2306,
      "sitare": 2307,
      "baith": 2308,
      "ghairat": 2309,
      "bula": 2310,
      "samajhta": 2311,
      "mehrban": 2312,
      "anjum": 2313,
      "shumar": 2314,
      "hansi": 2315,
      "raftar": 2316,
      "sochta": 2317,
      "majbur": 2318,
      "jhuk": 2319,
      "udasi": 2320,
      "mastana": 2321,
      "raqs": 2322,
      "fitne": 2323,
      "alluq": 2324,
      "mita": 2325,
      "bakhsh": 2326,
      "khinchta": 2327,
      "bujhe": 2328,
      "taqdir": 2329,
      "kohkan": 2330,
      "luckno": 2331,
      "thokar": 2332,
      "uthti": 2333,
      "tavaf": 2334,
      "aabru": 2335,
      "divanon": 2336,
      "divangi": 2337,
      "shanas": 2338,
      "utthe": 2339,
      "dastar": 2340,
      "panch": 2341,
      "iltifat": 2342,
      "mehman": 2343,
      "bigad": 2344,
      "pyare": 2345,
      "rizq": 2346,
      "rahnuma": 2347,
      "libas": 2348,
      "nuur": 2349,
      "mayus": 2350,
      "shakl": 2351,
      "behtar": 2352,
      "fusun": 2353,
      "jyuun": 2354,
      "paimana": 2355,
      "paigham": 2356,
      "lucknow": 2357,
      "ama": 2358,
      "bho": 2359,
      "bud": 2360,
      "dah": 2361,
      "dani": 2362,
      "em": 2363,
      "fi": 2364,
      "ghani": 2365,
      "jhalak": 2366,
      "lal": 2367,
      "phe": 2368,
      "panj": 2369,
      "palak": 2370,
      "qi": 2371,
      "ri": 2372,
      "rin": 2373,
      "rida": 2374,
      "sanj": 2375,
      "uzr": 2376,
      "vab": 2377,
      "-af": 2378,
      "-nabi": 2379,
      "-sas": 2380,
      "-yani": 2381,
      "-mas": 2382,
      "-dh": 2383,
      "-don": 2384,
      "-tani": 2385,
      "-kir": 2386,
      "-zish": 2387,
      "haar": 2388,
      "-hil": 2389,
      "-hit": 2390,
      "nag": 2391,
      "naza": 2392,
      "namak": 2393,
      "kaman": 2394,
      "kaghaz": 2395,
      "-und": 2396,
      "mahak": 2397,
      "baab": 2398,
      "baare": 2399,
      "bakht": 2400,
      "-khl": 2401,
      "-dak": 2402,
      "huur": 2403,
      "-tala": 2404,
      "rakha": 2405,
      "bhig": 2406,
      "karni": 2407,
      "dili": 2408,
      "muz": 2409,
      "mukar": 2410,
      "gaanv": 2411,
