[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
[EOS]
!
'
,
-
.
?
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
۔
-a
-n
-g
-i
-s
-l
-y
-h
-u
-m
-j
-e
-d
-r
-t
-o
-k
-z
-b
-f
-p
-v
-q
-c
-x
--
-'
-w
-ar
ha
-ha
-hi
hai
-an
na
ki
ka
-at
-en
-ya
-un
-ah
ja
se
men
ko
sa
-in
-sh
-il
-ir
ma
ba
ke
-am
ho
-kh
-hin
-ur
-da
hu
-hu
hain
-ta
-on
to
ra
bhi
-han
aa
kar
-ch
-al
ham
dil
nahin
-is
mu
-ab
-he
-har
tu
-te
kya
ga
sha
vo
ye
-as
-na
-ti
de
-ad
cha
us
-er
khu
jo
ta
-ul
kha
va
ab
ya
par
ne
hi
ku
tha
-la
-chh
-ne
main
gha
muj
-va
rah
-hir
la
ni
pa
be
di
-gar
-ana
ap
dar
-ye
huun
-zar
mir
koi
tir
kuchh
aur
-ho
kis
-uun
-ut
an
har
pe
-gi
-ga
mer
-man
-ara
si
is
gaya
da
ish
dekh
phir
-ane
li
ik
-ma
-ari
bah
tum
kab
-ge
sab
-li
as
-gh
ai
-le
hua
sar
du
ter
un
ch
-ni
jis
kah
ishq
gu
-ra
mujhe
-ang
tar
-za
-ata
-jh
thi
mil
gar
raha
gham
mujh
jaa
tak
le
su
-kha
kh
jab
ji
-di
ut
-hr
-fa
ky
-sha
-iya
ru
ek
-ani
en
-ate
gul
za
nazar
-ath
mo
bar
-yan
bad
-aq
do
nik
zin
ban
mire
-us
kabhi
mar
so
ghar
-mi
-bar
kahan
-ala
kyuun
rahe
in
the
kisi
-ise
-bat
jan
apne
bahut
aaj
zam
man
sam
tiri
tire
-it
kiya
-gah
magar
sak
apni
-var
hue
shab
zinda
al
mah
rang
sun
agar
-mat
-hiye
pu
pah
-are
tujh
jal
-uq
baat
din
nigah
dam
qa
-sa
hui
miri
meri
az
-hab
khud
ak
-ib
ankh
naz
liye
qad
has
sho
-ish
-um
-ati
shar
kam
khuda
tarah
ro
-ka
bas
diya
mere
shi
-rat
lo
hota
yaad
dard
sah
-kin
bhar
-st
-kar
-iz
-shi
-van
jahan
apna
bi
-cha
zindagi
ah
-az
-yat
tam
-dar
jaan
chal
ar
-de
hus
aap
sur
-uj
ash
dun
kahin
husn
yuun
jaane
gir
aaya
vahi
mohab
mohabbat
saath
khan
-tar
aan
duniya
char
um
-dan
sham
lag
chan
lab
vaq
zar
-ak
teri
it
-hen
tab
kaun
-hun
khush
abhi
zab
zul
-ban
mai
raat
shahr
khat
log
-im
-ale
vafa
tere
af
-lam
-ve
-jhe
-far
rahi
chand
bhu
qat
-vab
-hal
bada
rakh
ina
bat
tas
hamen
chash
mera
lekin
puchh
aj
ada
-sta
ais
-qat
dekha
hij
chho
sub
vaqt
haath
chu
-ast
tan
baz
ju
-agh
nas
kare
karte
chashm
khar
pad
-aya
-id
-yad
hon
pai
hava
guzar
-kan
use
ad
-uf
-re
-enge
jam
mira
-lib
fa
-ub
-anj
go
-chch
bahar
-aqi
ankhon
tal
tira
tara
-gha
hal
-ud
-fat
jaate
-ina
-che
tera
yar
naam
far
kho
mat
ul
-dhar
-kr
hoga
me
mun
kaam
vas
han
shauq
kahte
suk
dost
-fil
-sht
-khm
chahiye
ashi
zaban
at
achch
sahi
-ali
chale
sit
utha
aate
-ke
khabar
liya
zulf
jun
-yon
-yal
tujhe
bana
jin
khi
vah
-shan
-ri
mas
yaan
khvab
jaana
-vaz
zakhm
manz
aankh
junun
pya
-san
sama
mauj
khayal
umr
var
-ila
duur
chhu
san
-gan
-khi
jaata
shakh
laa
akhir
ahl
hijr
taraf
suun
te
-pa
sada
-ind
bait
ghair
dush
chhod
fir
kaise
hoti
-tab
khaak
laga
guz
jigar
-shat
band
bazm
aata
-ja
naq
yahi
manzil
pur
-ki
-zan
-qi
jaise
safar
baar
aad
mud
bha
fas
pi
-vat
kit
-shk
yahan
dagh
dekhte
surat
bu
dast
-yar
-hon
karo
kham
yak
dikha
dariya
nikle
bul
hote
-ura
ghalib
khun
zamin
ankhen
roz
am
phu
zara
-sat
-qa
chaman
khul
nikla
inti
ega
-ikr
firaq
che
nis
-tan
ghaz
-alak
zamana
qadam
samajh
-iyan
-tish
yaar
kuun
pahle
sitam
dhun
shayad
lagta
bo
chi
dhu
fur
ghu
il
-su
-zu
-had
-ahr
maq
tumhar
mile
alam
qaya
aisa
tanha
iin
-sar
kal
kais
ras
mus
nikal
dushman
-hta
kiye
siva
jalva
charagh
mehr
sukhan
aise
aati
-hat
kaf
asad
milta
rukh
hasti
shik
atish
but
den
-uk
-kht
aalam
karen
suna
ashna
badal
kharab
qayamat
re
haal
kaha
jaati
-daz
usi
anj
-mid
ashiq
aah
eh
khin
shu
she
-ba
-fas
divar
bhuul
baten
aadmi
qar
ti
-val
-vana
-ham
saa
raah
kahun
daman
sahra
hans
achchha
vahshat
-anv
sau
raf
shai
dua
jise
soch
mahfil
khana
munh
pyaar
varna
phuul
iz
qis
-aj
-ine
aage
shaam
asman
mila
sharab
gun
im
lut
-gu
-ji
hazar
hayat
nash
saaqi
maj
rab
hamari
zamane
sake
aisi
juda
dhund
ara
jhu
pas
-dat
hav
baaqi
rak
qadar
sahar
tamam
itna
qatil
faq
hun
mis
uda
-je
sad
mast
-hane
hamare
lage
tumhen
saba
samj
hasrat
ashk
talab
aar
lah
sang
hat
bal
bala
hosh
raq
vaale
ani
utar
enge
sakta
pahun
ulfat
av
fit
len
pal
qab
-lat
-uh
haa
-anna
kash
kahiye
vaala
abr
paa
paaya
andaz
likh
asar
kyun
tamanna
afs
naqsh
egi
gali
-hra
-uhar
-mar
-zi
-hid
paas
ajab
shakhs
guzre
bata
khir
mit
ranj
-ghan
-bul
haq
-asha
daur
lete
khva
badan
all
avaz
gah
iye
khe
pat
qas
ud
zo
-nam
-if
-hte
nau
kaho
-yam
-khe
-uri
-hana
karun
karta
khak
parda
isi
-hre
shor
baithe
havas
aane
bis
falak
his
mi
-zat
haan
-and
nam
mal
maza
-urda
mushk
paanv
-araz
guman
jit
zafar
sharm
tamasha
khatir
kaisi
vir
-uz
-jar
-ran
-osh
saz
saman
maut
maus
rag
dete
khal
khata
dekhna
-mak
ummid
tabi
paida
vasl
tegh
aarzu
kyunkar
mausam
ala
miz
tala
-ida
-ije
-vani
had
-hish
-ira
rau
rasta
-hani
karti
lagi
dukh
-dish
soz
alum
itni
ghazal
samjha
bane
fikr
ghun
gila
lam
mur
tah
-up
-eh
-ton
-ft
-ftar
-hista
nafas
jala
-shta
makan
bakh
karam
karna
hamara
khuun
khula
-ula
pare
gardish
marg
chalo
pade
muddat
intizar
khinch
ahista
buj
don
kan
rish
zanj
-eban
-bu
-bad
-vir
-shar
hona
khudi
khushi
taq
vahan
yaq
siya
dekho
sabr
unhen
kahna
zahir
zauq
jante
aansu
chehre
chiiz
khvahish
mushkil
pareshan
donon
zanjir
idhar
qal
rat
zal
-ash
-nat
-rar
-bi
haz
saf
raus
aag
aave
-istan
muq
chala
laz
and
dava
dasht
jism
gareban
moh
janan
samb
khushbu
qatra
fasl
ghubar
qismat
lutf
-jiye
hathon
raushan
udhar
val
zikr
-si
-se
-uma
-oge
naaz
jaz
koh
sach
-she
-shr
hone
musa
-hed
beg
kahta
tark
jaao
rus
azad
hasil
shokh
-shish
-lamat
honge
faza
laakh
bulbul
sher
allah
bin
fari
fare
ir
ila
lu
qur
tho
vali
nagh
kat
saj
bagha
-khar
raz
josh
niya
paani
haram
uth
sakti
ahd
nasib
fursat
tumhare
lazzat
sir
tari
uj
vis
-hur
-khiye
-chan
kiije
-undar
jag
saari
saare
baha
-khti
niind
didar
zindan
insan
samjhe
samundar
rakhte
tasvir
khol
mudda
hunar
lahu
rusva
visal
aana
pata
zer
-sin
-fi
-vv
haqi
hashr
nava
jafa
saan
saza
-dad
rashk
hamin
dekhiye
chaar
tap
vaj
rahta
pada
harf
gard
khur
puch
shokhi
gira
chara
aji
hijab
chup
juz
adam
chhup
kitna
furqat
raste
ehsan
rafta
qasam
zalim
baghair
haqiqat
faraz
jur
-ghar
-mil
-dam
-ron
-vish
-hala
jauhar
say
maz
tod
chahe
tava
divana
sabhi
gum
garm
ruuh
gulshan
shabnam
bich
arz
logon
-ghaf
halat
achchhi
chhupa
bhala
kitne
yaaro
dhuup
faqat
hisab
sambhal
ajiib
bura
dha
dan
dho
ghur
ij
pin
ron
shir
sara
-uman
-me
-tin
-thar
hairat
nama
-atan
javab
saghar
maan
mash
bayan
aab
-all
shah
der
deta
taghaf
abad
pari
diye
divan
dari
siine
dekhe
thiin
gharib
janta
samne
azma
ake
sharar
suraj
qatl
tez
chehra
nishan
dhuan
maqam
kafir
qarar
shaikh
gunah
begana
fareb
taghaful
avar
-nun
-iha
-bab
naya
maana
bazar
-isa
tuk
chahta
khuub
taqat
vaan
nihan
dida
daagh
asan
kahen
barq
gharaz
-miyan
-kayat
khane
itne
zabt
jamal
faiz
shikast
imti
khiram
ghuncha
yaqin
hazrat
naghma
sayyad
aq
dahr
ikhti
jang
lala
pir
shan
tish
ub
-avv
-lon
-zr
-bani
-fir
kahe
-shni
bach
bacha
-khta
-ure
-tak
karne
dilon
mub
tuu
khali
vaa
thahar
rahgu
nib
-gahi
sabab
dub
chha
tarz
utt
ruk
barbad
mard
saka
azi
akbar
hasin
-shid
khanjar
zarra
tasavv
chuka
sanam
dastan
rasm
talash
raushni
andhe
mohsin
valon
tishna
rahguzar
das
hur
iman
miyan
pan
rut
vatan
zan
-yo
-ughan
-vah
hairan
nala
kin
kahi
kaash
-yaban
jalib
sakht
baja
bayaban
raaz
mut
tuut
chamak
taj
parvana
rahte
paira
kise
pesh
-arib
rahat
takall
aksar
basar
basti
bhari
bhula
rakhta
puchho
nashin
goya
intiha
ghazab
ilti
kaisa
musk
shikva
raqib
siyah
niyaz
ikhtiyar
tasavvur
gan
ib
nar
qarib
yun
yad
zid
-gam
-son
-lu
-yyat
-hgan
-ram
-fta
-chi
haus
nakh
nadan
kade
saaya
salamat
mad
badi
hogi
-ulat
khair
khafa
kusha
ghafil
-vafa
raho
payam
betab
bevafa
hargi
bahr
chhed
garche
-diyon
badh
nazuk
qadr
shisha
shikayat
arzu
girya
zulm
bhul
paiman
matl
meh
vasim
hangam
masti
guzri
bujh
khamosh
anjam
tibar
nashsha
majnun
dhundte
rakkha
misl
avara
qaba
iyega
patthar
miza
khalvat
mizhgan
musafir
bichhad
avargi
aql
pairahan
yunhi
hargiz
dab
dhar
duun
fughan
iq
lad
numa
sula
ur
-ite
-uda
-dari
-kam
haya
nashat
kitab
jagah
sahab
saval
raa
karvan
-asi
-ass
chak
khauf
paate
dima
ang
kahne
guft
milne
zahid
banda
mange
manind
pahchan
qafas
bikhar
baton
adab
chuke
naseh
fais
-ghaz
rukhsat
anjuman
udaas
khel
bujha
saans
khurshid
pinhan
jangal
takalluf
matlab
mizaj
aam
bhe
jani
talak
zahr
-zir
-fan
-vi
-vari
jaam
javan
javani
sail
baaz
-dap
-tal
rasa
mul
shahid
dega
chali
tadap
him
laf
nigar
darmiyan
ped
sikha
dekhta
phirte
tumhin
-lif
aish
duub
guhar
garmi
khvar
jiine
-ust
marne
kahani
pahlu
nigahon
-kash
big
bimar
zarur
puchhte
-ufta
farma
vaste
sukut
sahil
banaya
jinhen
vahm
masiha
kitni
musal
shukr
tiir
rakkhe
pahunche
fitrat
rishta
muqad
jurm
shirin
akela
faisla
'-
ay
ana
chin
dur
dal
dad
fana
ge
hir
hina
mina
pha
sat
tur
ziya
-ugu
-dir
-ru
-tir
-oshi
-zur
-bra
naf
navaz
-ahe
koshish
saya
-inda
bagh
-alli
dilbar
mula
-asta
chad
khuban
khas
parvaz
thahr
ghadi
mujhi
rahen
laaya
darkar
pech
dekhun
dekhne
likha
sabza
-lim
tarab
gulistan
barpa
badla
sakte
qaa
qais
nazr
shikar
lagti
aftab
taskin
khila
sanvar
samajhte
tumhari
nikalti
dena
sauda
pahuncha
abru
-urdagi
jitna
jitne
raten
jazb
rone
sarapa
imtihan
aziiz
dimagh
guftugu
himmat
lafz
aza
bari
fan
juun
jum
min
py
rind
sata
umid
ze
-gal
-iq
-jum
-zam
-bur
naala
naale
kidhar
kiran
kalam
kaif
jaur
sair
safa
baagh
hujum
aao
hamdam
dila
gauhar
deti
vahin
paras
kucha
nim
pak
bedad
ande
dahan
daulat
thik
mili
gardan
barg
baras
badha
samt
mahshar
rangin
jalve
azal
nazm
sahl
aram
arman
giran
charkh
honton
ashiqi
khizan
baitha
bol
maqtal
tumhara
butan
dene
qissa
faqir
hunuz
misal
fitna
lena
bismil
malum
viran
mizha
qalam
sirf
ganva
hausla
ziyada
mulaqat
thahri
ag
ava
cho
dhan
dhal
gari
gale
gure
iyan
just
kun
kul
mata
qam
riz
sina
tad
tang
umi
zeh
-aza
-esha
-kta
-kon
-ze
-flat
-pe
nakam
kijiye
kada
kami
kashi
sali
saqi
-ile
maara
hove
raun
ravan
ravish
hamesha
-isi
-ist
musht
-abi
dekhi
chain
chaak
taz
taar
parva
kuche
ghabra
ghaflat
rahne
lau
dikh
-gari
angan
-arak
sifat
daam
phiri
aib
chhin
milti
uthe
uthta
-faq
-shad
sune
dinon
qaza
qaid
qafil
kamal
-uju
ashufta
khanda
labon
tabass
khatm
-ved
chandni
tasir
chhoda
havaon
gosh
ulti
munta
khil
khizr
sann
fasana
-suon
maqs
dushmani
ehti
qarari
hazaron
mitti
zor
bistar
ilaaj
puchhe
ghurur
muskura
justuju
zehn
tabassum
denge
fis
jha
luun
qub
til
yus
zun
zad
-ada
-ik
-ibat
-iyat
-hbat
-os
-oh
-bal
-bish
-vara
-vane
-qe
hali
-hak
kas
sal
sap
sadiyon
-iri
-khon
huzur
toh
-alo
-ism
mum
tufan
shag
khule
khubi
taur
taab
vada
parde
-lak
ghata
rahn
rahna
rahzan
did
auron
harif
daf
dair
daftar
lik
lib
kabhu
chhan
milte
taklif
utna
zada
nazara
sohbat
janen
manzar
shabab
mahv
mahram
suno
sunte
jalte
nigahen
aziz
kamar
shikan
surma
girah
shams
tabah
bazi
halqa
faro
sukun
dushvar
guzra
buu
khamoshi
buland
khulta
bosa
musibat
badalte
ret
sheva
saaf
nashe
pasand
avval
palat
kashti
afsana
sharminda
murad
murgh
pareshani
raton
muqab
fariyad
luut
sajan
vajud
giraftar
-halak
mubarak
ayyam
jumbish
minnat
umiid
qubul
yusuf
zunn
akh
azar
agahi
bina
dana
gin
ine
jhan
nu
nang
nuq
uq
ula
vus
zi
-non
-gun
-gis
-ghal
-sti
-jli
-zib
-andi
naha
kaan
jaad
jaga
jale
jaisa
sav
saara
may
mazar
magh
malamat
bahal
baqa
huk
rahin
rava
aahat
muam
musta
mushta
gada
shad
shak
cham
chaun
khum
khub
tai
taqa
-ulan
vagar
vaalo
thak
-lahat
rahmat
laut
lakht
lakhon
nigahi
beh
bedar
diin
diid
-uth
andar
sip
sitar
daad
daana
ishara
ishare
phirta
sarab
dus
ungi
jaag
leta
khvan
jabin
bade
badle
-ushi
jannat
agarche
aks
shola
rote
sahba
bijli
khushk
bhule
nasir
padi
padh
paikar
farhad
ashiyan
masj
maslahat
maujud
khamushi
amal
nisar
nisbat
mehrbani
reza
iztir
rabt
raqam
likhun
afsos
lamha
tahzib
ilahi
thodi
ujala
charaghan
dhoka
ghurbat
nargis
hangama
musalman
muqaddar
nafrat
azaab
gurezan
raunaq
dikhla
muntazir
mumkin
shamshir
muqabil
zunnar
ulajh
jaadu
mushtaq
taqaza
vagarna
iztirab
agh
aghaz
bhed
egan
fara
fus
jy
jhon
nur
num
pil
piya
ram
sil
sul
sari
uch
ziyan
zist
-no
-gani
-sal
-sari
-yana
-yyar
-mon
-jj
-jat
-rib
-tu
-kno
-bari
-fl
-fr
-vvat
-ckno
nab
nagar
kaa
saq
said
bam
baad
bachch
bashar
raza
karish
karenge
mukh
tut
gavara
-adi
chaha
khuli
khusha
khumar
khasta
para
parsa
kushta
kufr
paar
paim
digar
dijiye
ansuon
sim
sid
siin
ise
isti
daa
daal
phire
lip
dukan
unvan
chura
guftar
taron
-zakh
sum
khvah
jivan
jiina
uthte
ruuth
enat
gulab
moti
barab
marte
marham
janab
mans
saki
mahtab
pahc
-haba
-ishen
shart
bhare
bii
-chal
ahval
chalta
mohabbaton
zaruri
zulmat
inayat
chuki
khari
paigha
guzarne
yaron
matam
ulj
sahib
sitara
sitare
baith
ghairat
bula
samajhta
mehrban
anjum
shumar
hansi
raftar
sochta
majbur
jhuk
udasi
mastana
raqs
fitne
alluq
mita
bakhsh
khinchta
bujhe
taqdir
kohkan
luckno
thokar
uthti
tavaf
aabru
divanon
divangi
shanas
utthe
dastar
panch
iltifat
mehman
bigad
pyare
rizq
rahnuma
libas
nuur
mayus
shakl
behtar
fusun
jyuun
paimana
paigham
lucknow
ama
bho
bud
dah
dani
em
fi
ghani
jhalak
lal
phe
panj
palak
qi
ri
rin
rida
sanj
uzr
vab
-af
-nabi
-sas
-yani
-mas
-dh
-don
-tani
-kir
-zish
haar
-hil
-hit
nag
naza
namak
kaman
kaghaz
-und
mahak
baab
baare
bakht
-khl
-dak
huur
-tala
rakha
bhig
karni
dili
muz
mukar
gaanv
gaahe
shadi
shake
shajar
-asr
-asim
chahat
ustu
tavan
taaza
khaz
khaar
vaar
aba
rahm
rahun
rahbar
laila
lauh
pagal
bech
divane
dars
darman
daraz
siina
isa
lijiye
-liyan
asa
asi
astin
sard
sarv
unga
chun
kahti
gudaz
takrar
lega
sukh
jiye
jiite
-shak
mom
dosti
nikl
bandi
marta
marna
sozan
rahega
inkar
samar
zindagani
azm
akasr
nazzar
nazdi
rok
shishe
bikh
chalte
arsh
arsa
surur
lagte
vaqi
zard
zarre
maidan
khatra
khatre
afshan
tasalli
puchhta
ajal
ajnabi
adavat
nasim
padta
paiham
adu
talvar
talib
hanuz
doston
pyaas
pyasa
chhut
hijran
bandh
bandhte
naqab
pich
rozgar
amir
phulon
bojh
ilm
nikalte
charaghon
kafan
buton
resha
ehsas
saada
araq
jhuka
ashkon
talabgar
qabil
likhna
gumani
khalq
lamhon
azadi
qurb
puchha
tavajj
ijz
namaz
mashq
ubhar
tuuta
nibha
kinara
iqbal
sulag
angda
mulk
gesu
hirs
phail
nazren
barish
andesha
saliqa
sannata
maqsud
ehtiyat
tohmat
dafn
buujh
sitaron
masjid
aghyar
bachchon
kharidar
ghanimat
tavajjoh
ahu
aman
aari
aqi
buun
dhad
eid
he
hil
hind
iyon
lenge
mari
mang
mura
no
po
pila
qib
riya
tim
tahr
uf
ush
uup
vale
-ach
-sib
-rud
-kul
-br
-bir
-pan
-arat
hab
-angi
nair
nadi
nashad
naved
kaj
kate
kasha
kashish
-yaz
jaun
jash
jaisi
savab
mam
maane
masa
bahi
baham
baada
-one
raas
rast
aas
aafat
karb
karan
karda
dilli
muda
muft
tul
shaad
-tida
chah
chap
chaah
chaal
chahte
tahi
tash
tauf
takht
tayyar
khaj
khade
khatar
vaah
vash
vaise
yaas
thahra
-laq
ghash
-vaza
-vaida
rahon
lash
bek
beja
diida
darte
darvaza
-hosh
anda
ange
dayar
ishrat
sabz
astan
sarf
duk
ung
chhe
-jhen
milna
takra
suvaida
jiit
uthi
-faqat
-shaq
gulzar
zaat
mohr
mohta
barsat
barham
barson
dozakh
nikli
banta
marhala
marhaba
marasim
socha
rahegi
inq
inan
inhin
zamir
samjhen
sakun
suni
sunta
puk
pukar
jalta
huiin
qadah
qadmon
roya
rota
roke
bichh
-azat
chalne
surkh
suragh
dunga
zarf
itr
afr
taslim
chashma
chhode
hongi
-uba
gor
talkh
talkhi
tarash
farda
achchhe
jins
manzur
akhiri
ghairon
bandha
purane
aadat
bhatak
pighal
karobar
yakta
amad
amla
bole
ghus
ilzam
khinchi
qarz
hanste
rafu
shaida
socho
nashtar
jhuut
sadgi
avenge
lene
paash
afsurda
galiyon
nauha
karunga
virani
alag
lamhe
bakhsha
muddaton
rishte
siyahi
qalb
valv
qurbat
sajda
niyazi
ujde
tapak
gardun
ijazat
rona
akele
gunahgar
imtiyaz
ubal
tuute
hasinon
tajalli
muskur
ibrat
nakhun
betabi
mehnat
dhara
iqrar
baazu
parastish
thikana
thikane
tadbir
tilism
shaguf
chhanv
akhbar
nuqsan
uqda
hukm
chaunk
uchhal
saqiya
barabar
mansub
panja
nazdik
pichhe
buund
muravvat
tahrir
ushshaq
uupar
kashakash
jashn
taufiq
mohtasib
ain
ale
ade
bun
bani
buri
el
fah
fal
if
ima
ira
iid
ikht
ibad
iyo
je
lahr
mana
maraz
phan
pab
pho
phen
phun
phal
qahr
rul
riha
sane
thu
than
tale
vadi
zil
zuh
-ap
-ahi
-ikh
-iman
-iza
-idan
-iyon
-sil
-sir
-sus
-sish
-lah
-yy
-yun
-huri
-jaz
-du
-ddat
-rir
-ruba
-thi
-tah
-tte
-ken
-khir
-kira
-zon
-vam
-venge
-qq
-qab
habab
-hami
nai
nain
naji
najat
kir
kaat
kaab
kali
kale
kasa
kavish
jada
jaari
jaoge
javed
jaulan
saaz
salam
salib
saja
maar
maare
makr
basa
bahana
hotin
-dal
hush
-hum
-tav
karvat
-alab
dilruba
muhal
mughan
mukhta
muhit
tuun
gaam
gahan
gashta
shahi
shafaq
-ase
-ade
chadar
-ere
khus
taare
tauq
khaa
khate
khati
vaz
vaf
abas
paron
parast
partav
nek
kushi
thaam
ghaur
lagh
nikhar
paak
pahad
beb
beach
dikhe
-garm
dare
-yega
kisu
anis
angu
-mane
ista
davat
davam
ishva
phirti
-maya
asrar
sargarm
dud
chur
chhal
ghamza
jaave
sud
sup
-khab
khvari
-diyan
uthane
-hrat
ruke
barat
badban
badnam
zinat
bano
banti
-usar
sote
gharat
insa
zaman
manus
sunane
pusht
jalne
azurda
nazron
shori
shohrat
-atiyan
sharh
sharma
kamin
kamil
roti
basta
shiddat
bharo
bharam
-chak
ahbab
jaano
chalna
chalti
arbab
girte
aanch
charcha
chang
zabani
khatt
rakhun
batate
taskhir
subuk
tangi
bazu
karega
padti
hont
paikan
fakh
farq
hansa
zulfan
vahshi
khvabon
zakhmon
naqd
naqsha
manzilen
purana
pursish
dikhaya
bulandi
intikhab
nishani
dhunde
ghulam
milega
rukhsar
kharabi
kharabat
khinche
shua
tifl
hansne
izzat
dhundhta
balin
pahunch
likhte
afsane
batao
khirad
khirman
dauran
gahra
khez
patta
udne
zof
naubat
khaksari
bisat
hisse
namrud
malal
mazaq
jitni
virana
ummiden
bakhshi
kanar
rishton
hazir
andhi
mohlat
jazbat
kohsar
musav
begane
qurban
thoda
tarikh
ujad
maze
shararat
tukde
mubtala
khalish
nibah
dubo
zanu
mutthi
ibtida
narm
yadon
bhulne
daba
ladka
sulaiman
raahi
bandagi
aamad
janib
muqaddam
navazi
baghban
chadhte
lafzon
dhanak
kunj
kulfat
qafila
qafile
fishan
fishani
kasrat
likkha
farogh
shadman
jhonka
numud
karishma
lipat
pahchane
pher
qimat
rindan
bhigta
shakeba
asiir
dhadkan
bahisht
raston
mudava
lashkar
inqalab
valvale
irada
ibadat
jeb
mukhtasar
insaf
shorida
''
ali
auq
afaq
bur
bhan
bure
dh
eq
ejaz
fuz
fida
fulan
ghi
gho
ganj
hila
id
iri
jana
jara
jila
lub
mane
nil
nir
nus
nuk
pam
posh
qu
qul
qus
qud
rula
shane
shana
tun
tin
tit
ude
ufta
ugal
ve
vara
yu
yas
zat
zah
zud
zahe
-afat
-nin
-lad
-hda
-uch
-umi
-mun
-mari
-jte
-jub
-ekha
-dur
-dani
-rur
-ob
-kat
-kim
-bin
-baz
-von
-xism
hafi
hakim
-haz
-hiyan
-ant
-andar
kim
kap
kashan
kausar
-yab
-unga
jaal
sehr
kotah
saun
saal
sakhti
-shna
-iron
maah
mauq
makin
maula
bag
bab
bac
baam
baal
bahane
-khvan
-dakta
-ona
razi
ravani
kari
-chha
-chon
dilbari
-ista
muus
gaz
gavah
shaan
shash
shahan
shamat
shahad
-asar
-asaz
-adon
-adis
chahun
khufta
taf
taan
tavani
khada
khama
khashak
vaisi
abg
abla
yag
yahin
parchha
neki
thahre
ghal
ghalat
rahti
lada
lachak
niha
nish
niyyat
paata
paoge
becha
apnon
darta
darban
darvaz
anchal
harim
pesha
siikh
daar
daala
daale
dekhen
phira
lihaz
-maga
bahs
bahta
bahte
bahari
kabab
sabat
sabit
asum
asbab
asiri
sarshar
sarmaya
sarasar
dukha
unhin
chhat
chhid
chhuri
gusta
-rav
milen
garon
garmiyan
jaada
jaage
takmil
khvani
jidhar
uthen
-hron
-faz
-shah
gulu
zaval
mol
mod
badhe
badli
badhte
dosh
nikale
banane
banhon
marzi
marxism
sokhta
gharq
-midi
kahaniyan
mand
mandir
sako
saken
shabistan
alon
aluda
mahb
mahke
mahki
sunun
pahli
pahron
jald
jallad
azmane
naznin
sharafat
kamre
kamyab
khudaya
sahara
bhara
-vand
bik
biit
tamir
chalan
ashkar
khanon
charasaz
labi
labre
zulekha
khatka
afat
afza
aflak
qatre
batil
batla
puchhun
ajza
ajjub
chhodi
chuun
chuum
guzari
adh
goshe
-ghat
yaran
farz
kholi
mathe
vasf
-shtan
-shton
ashiyana
aten
uthaya
uthate
zulfen
zulfon
khid
khayalon
sanson
shakhon
laash
tevar
bandon
purani
aadam
bhaa
bhag
bhage
bhali
pichh
piye
piite
piiri
dikhati
ambar
khulus
khultin
chehron
-tanat
chikh
-bada
divaron
kahunga
rafiq
sharabi
gungun
imkan
majaz
dhundla
pasban
havadis
rakhiye
misr
samjho
talabi
palkon
qabr
qabron
likhta
kyunki
afsurdagi
ranjish
khvahan
patton
qasid
udti
virane
talafi
hadis
hadsa
rauzan
ghunt
ghunche
jalaya
bakhshe
bakhshish
kanton
taqrir
yaqub
siyasat
khvahishon
qalandar
-bih
safha
farishta
irshad
luta
naghme
katti
sirat
tariq
tariki
samundaron
kholte
saanp
tapish
puchhiye
chhupana
raftagan
mazmun
tavaqq
bichha
sambhalta
dandan
dhoke
ijad
dariche
bachcha
tuuti
khaliq
dubte
chhati
uttha
andhere
andheron
tishnagi
dastak
panah
kahiyo
mutrib
mutlaq
chamakti
nashinon
iltimas
nakhuda
madd
bhulane
paimane
pattharon
uryan
raakh
bhej
janiye
sailab
zarurat
musalsal
dalil
turra
chadha
khilaf
kaifiyat
parasti
andesh
faqiron
aghosh
chor
chot
tazgi
sannate
maqsad
saltanat
likkhe
azizan
nasheb
nahaq
savere
maghrur
chamka
dusra
faragh
ramz
sils
nabz
kaafi
simab
sumbul
biich
uljhan
shanasa
amada
danish
emal
figar
rifaqat
vabal
nagri
mukarrar
ustukhvan
khazana
niklen
nazzare
hech
hilal
qibla
nairang
chappe
bekasi
angez
dukhane
ungliyan
pukare
ghusse
fahm
imaam
zillat
zuhur
kirdar
hushyar
vafad
laghzish
daregh
angusht
supurdagi
bharosa
fakhr
musavvir
auqat
dhyan
jarahat
lubha
nuskha
nukta
qusur
qudrat
varaq
muusa
gustakhi
labrez
tavaqqo
aya
ata
ahan
ach
agah
atak
bil
eda
eri
fat
gil
ghin
ghan
gal
gala
ghane
ii
ita
iza
itab
jhe
jane
jata
jhad
jham
jhil
lar
mani
naraz
oj
odh
phi
put
pani
pit
qum
tat
thar
tana
ug
uun
uman
vari
zari
zani
-av
-nu
-gda
-gnu
-ih
-ij
-iyyat
-sp
-sen
-sab
-sani
-lhe
-lana
-lman
-yari
-hd
-uta
-uti
-ude
-mb
-mul
-jha
-jhi
-juman
-ez
-dud
-ro
-rah
-rab
-rad
-riya
-rim
-ruf
-tara
-tni
-tvan
-ol
-ko
-kas
-zum
-bah
-par
-pka
-qon
-aron
haf
hajat
haif
nafa
nami
nadam
kish
kach
kati
kaate
kakul
-engi
-yaza
-yadi
jaza
jave
jasta
javah
seh
savar
saik
-ini
-inon
-ire
mau
maha
maat
maya
mali
maani
mashi
makhm
mashr
machal
bash
bayani
baap
baiza
baant
-amin
honi
-khshan
-khtan
-urrad
huma
rad
raam
rasan
ravi
bhigi
bhige
aaoge
dilcha
dildari
dilkash
-isan
mua
mukha
musha
mufl
-abu
-hez
tuti
tujhi
-tega
shahin
shayan
-asib
-tiq
degi
chahen
chatak
taa
tav
taal
taul
taara
taza
taus
tazi
-uli
khaza
khabari
abe
ablon
parcha
parhez
hikayat
thakan
-chhon
ghaat
ghali
mujass
lai
laal
laata
lahad
lakir
laqab
niyam
nihani
pag
paz
pairon
bel
bekar
diije
darun
darbar
darja
darpe
tirgi
auraq
ankhi
haris
harne
pechan
sif
daali
dakhl
dashna
isharat
dekhti
liije
ikram
bahla
kabk
sabaq
-liz
asl
asir
asli
asani
-ghl
saron
sarfa
duha
uncha
chhi
chhalak
gusar
-rak
taras
tarjuman
milenge
millat
sudhar
jabr
jii
jihat
jibr
-diya
-hram
-fak
ruh
rum
ruki
ruba
rudad
engi
nazari
mor
barf
barsa
bartara
dohr
dohra
niko
zinhar
soi
gharon
insani
janun
zamzam
zambur
manta
mandan
mantiq
-itan
-iton
-varon
almas
alfaz
mahmil
mahru
mahsus
rangon
sunne
sunsan
puj
puuri
pukhta
pahna
pahla
jalti
jalana
jalane
jaldi
jalate
qaabu
azab
azmat
azurdagi
shole
sharara
sharik
shifa
-stan
-ize
-shiyar
jahannam
biina
biite
bimari
chalen
are
ariz
arzan
-uja
ashuq
ashob
giri
gird
girye
vahid
ummat
shamil
lagan
lagana
lagenge
zarar
itra
tabar
tabib
khushki
shahron
batin
tasbih
puchhne
hijrat
chhote
subur
chub
chuur
chulhe
tanz
jugnu
nase
kharosh
padha
guzaran
guzarta
guzarte
guzarti
gosha
baharan
halqe
farsh
farang
farzan
farosh
khoi
khota
khole
matha
ulat
muns
munkir
munasib
dosto
aton
chalega
uthao
khile
khitab
-riq
masruf
pyala
pyase
khayalat
vardat
duuri
chhuta
sandal
sansen
laag
laao
suuna
sadaon
sadaqat
-indon
baithi
baithen
bandhe
manzilon
purkar
purze
bhad
bhadak
fasla
fasane
fasle
piine
buzur
karoge
khamyaza
yaksar
dikhata
khunab
amez
khuld
khulte
khulti
nistan
nishana
samajhti
bola
boriya
chidiyon
chilman
chitvan
dhuen
dhuul
ghul
maqbul
kalisa
nikalta
nikalne
dushmanon
mehrab
shikasta
dengi
badalne
anjan
ashiqon
khincha
shuda
shubah
shefta
vahshaten
saugan
duaon
sochen
sochun
guna
nashv
nashshe
majma
majra
jhuta
jhuki
rakkh
tamami
udaa
sadkon
aarsi
lahza
lahje
hoshyar
utarta
utarti
pahunchi
palken
mitne
ranjur
kheme
patang
udte
udata
zohd
naumidi
-khez
shorish
hisar
namus
malb
-urdagan
khatak
hadd
hadsat
hadson
banegi
lams
-ftari
khushiyon
yaqut
zalz
safina
saffak
andoh
sambha
jazba
fazaon
farigh
fariyadi
farebi
ilaj
qurbani
sajane
bahak
navak
tapka
tapidan
girafta
giraftari
charagar
chhupaya
mazamin
chahega
arzani
dhadakta
shiraza
-thara
namazi
gharibon
gunahon
shikaston
piri
bachpan
bachate
nibhane
dubta
chhap
utthi
utthen
mardana
mardum
aziyyat
andher
andhera
andheri
kinare
mutma
tajrab
iltija
raqibon
ganga
yadgar
hausle
madr
kushad
kushada
arzuen
bhulen
numayan
uryani
urdu
kitabon
raaja
bhes
bheji
bheje
baazi
mulla
tadapta
pedon
sikhata
duuba
bigde
gehun
gesuon
satati
turfa
turbat
khilaun
sanvare
rindana
sataya
zeb
zehan
kalami
sairab
pakad
baraste
bolen
qamar
qamat
rizvan
tadpa
nakami
hovega
tazkira
laute
sunega
jhagda
tohfa
shagufta
nasheman
avvalin
sharmindagi
savad
bahalta
muamla
sipar
dusre
nafraton
suluk
karishme
sidq
istiq
jhukti
udasiyon
dastaras
mayusi
amaan
bhole
dahshat
dahliz
vabasta
nagin
muzhda
khazane
darmanda
momin
nazzara
sulagte
amanat
mariz
nok
timad
timsal
ufuq
nadim
mamura
mamnun
karbala
andaza
andalib
chhedi
chhede
bichhde
afrang
qurbaten
falsa
ikhtila
pabandi
phod
phenk
rulaya
thuk
thanda
kaabe
kaleja
khusrav
bebasi
tiflan
andhiyon
muqaddama
shadmani
bhanvar
janaze
pamba
qulzum
uftada
kimiya
mauquf
shahadat
tafsil
abgina
yagana
nihayat
mahbub
adhura
khidki
pichhli
gunguna
maddham
achchhon
ojhal
tharthara
nadamat
kishvar
kachcha
javahar
malik
mashiyyat
makhmur
mashrab
dilchasp
taulen
tausan
khazaf
mujassam
darpesh
chhalakte
jibril
bartaraf
mahrumi
aun
auj
ayad
achan
alif
bara
bit
bhab
bhal
batiyan
dul
dhir
dham
duri
dhani
dall
eur
ede
ere
ehram
fil
fut
fani
fate
gam
ghe
ghir
guun
giya
ghon
giton
hen
iisa
ikhl
jhi
jat
jah
jhal
kand
lati
lasha
laraz
mon
mish
mim
nan
nuj
nosh
nindon
pon
pis
path
pand
phala
poshi
qah
ran
rana
rani
rif
rik
rangi
sin
sani
shun
sile
sone
sona
tis
tund
uz
uga
udi
uja
vuun
vida
yam
yab
zish
-ain
-aon
-nata
-ghi
-gir
-gas
-gate
-gmaga
-ig
-ip
-ihan
-iyy
-sur
-ste
-sad
-ssar
-sitan
-len
-lis
-lenge
-lub
-yur
-hne
-ush
-uza
-umat
-uka
-uki
-umak
-mta
-mal
-mala
-mba
-mughan
-ju
-jud
-et
-do
-dha
-den
-dun
-din
-dil
-dte
-dhal
-rin
-rana
-rani
-ruh
-tta
-tti
-tul
-tne
-tke
-tila
-od
-ozi
-ope
-ostan
-kt
-kad
-kara
-kari
-kati
-kkul
-zo
-zad
-zim
-buri
-fam
-fani
-path
-psin
-vin
-vre
-vri
-vase
-qah
-qil
-qam
-qqi
-ce
-chir
-chana
haat
haul
hala
haari
haare
haft
halak
-hada
-haman
-hib
-hida
-himan
haivan
haidar
hairani
-anon
-anki
-andiyon
nal
nak
naga
nasha
nabar
navar
namat
navish
nachi
nayyar
nakira
kiin
kisht
kad
kav
katar
kafar
kasu
kasi
kalim
-att
-aton
-ahna
java
jama
jaani
jami
jasus
saat
sava
sahir
saut
sadi
sahal
savari
sadiyan
-inde
-shon
-shtar
-ili
-ilen
-iran
mahi
maul
mala
mamat
mahal
mafat
madad
malak
magas
baj
bair
baari
bali
baani
bakhi
baaj
bachan
baasi
baghal
bauch
bajte
hoshiyar
-khmi
-hina
-dab
-daus
-dasta
-daba
-dakhta
huz
hub
huon
hudi
-taj
toda
rav
radi
raani
rahiye
rakhi
rafaqat
raihan
bhiid
bhiig
aaise
aase
kara
kargar
karani
karim
kardani
-chen
-alat
hami
hamdar
hamrah
dildar
-ishin
muha
mush
much
mugh
muhaba
muaf
-abat
-heli
-haron
tukhm
tulu
tufani
gaa
gahi
gaah
gava
gasht
shal
shami
shakar
shauk
shahana
shaghl
-asa
-asat
-asil
-nak
-tiyan
-tibar
-tikhar
dev
desh
chaat
chaur
chaho
chakan
-era
khutan
jot
joshish
taha
taari
taaq
taale
tahal
tasht
tavaz
tavana
taham
tayy
-ule
khad
khaas
khala
khadi
khami
khaki
vaari
vaisa
vazir
vaade
vapsin
abir
abshar
yaum
pardaz
paristan
parvari
parvane
parinde
hifa
hiire
kuud
kuja
kuuch
kushton
thal
thaan
thami
-chhta
ghat
ghabr
ghatte
mujrim
mujko
rahenge
laate
laale
laqa
ladak
lapka
niin
nida
nich
niche
nizam
nigun
nidhal
paara
payan
pashe
pachhta
besh
bezar
bedari
behosh
bediyan
divani
dara
darang
darpa
dariyan
darida
-hoshi
-utar
anvar
anqa
hari
harja
peche
-gaf
-mand
-arazi
sima
simat
sikan
sidhar
isyan
islam
israr
daara
dakan
dahak
daude
dagmaga
isharon
phirun
iksir
-mash
-makash
bahne
tumar
kabutar
sabil
-lid
asr
asal
ashami
-ghla
sarir
sarkar
sarvari
sarkash
sarsab
sargir
duud
dukhi
dumb
unat
unde
unche
unhon
chhun
chhil
chhit
kahenge
kahkas
gud
gusari
gudakhta
tarrar
tarbi
tarasta
-zaz
milana
milaya
ghamze
jaaya
takhir
takrana
legi
leve
suuf
suud
suhane
sukhe
khv
khone
jiy
jiya
jite
jibra
utr
utne
utara
utra
uthana
-hrenge
-iyad
rumi
ruka
rusta
gulon
gulsitan
gulfam
guldasta
zakhmi
moj
mohan
baran
barch
barkha
bardar
barsar
barzakh
barhami
barmala
barhaman
barahna
badon
badshah
dop
doge
doshi
zindi
banjh
banate
bande
banki
banjar
-usi
-ustan
maren
marti
marka
mardan
sog
soya
soti
sokhtan
gharane
-miyat
inon
insha
janon
janne
zamurrad
manin
manda
manga
manata
mandi
manenge
samate
samri
sakhi
-vare
mahn
mahr
sunati
sunaya
puuja
pumba
pahra
jalati
jalvat
jalvon
nigahban
qai
qaul
qaum
azir
azur
khuddari
nazan
nazil
nazish
qadd
hasb
shohada
-isht
sharbat
sharif
kamon
kamzo
khudaon
khudavand
rog
basi
base
shii
lohu
dardmand
sahe
sahun
sahte
sahma
sahare
bharne
-vandi
biti
biim
biini
tamkin
chalenge
ari
arka
arbada
armughan
husan
aapas
gire
girdab
khandan
khanuman
khanqah
lagne
lagane
lagate
chande
labada
vaqif
zarkhez
itti
itnon
tabir
tabahi
kaund
kaunain
khatti
logo
afv
afsan
bhuli
bhuke
bhuuk
badaulat
rakhe
rakht
rakhna
rakhne
batana
ajz
ajam
ajaz
ajize
chhoti
subu
subut
chusi
bazon
jui
nasiya
chashme
chashmon
khara
kharash
paden
padun
padin
padhe
padte
padhiye
padhte
paima
paivand
guzara
guzare
guzarna
fauj
goi
talne
talvon
tarazu
taraqqi
halanki
naame
fard
farman
farsa
khoj
khoya
khoti
khosha
matla
ulta
uljhe
ullah
mez
mund
munin
munfa
